[
    {
        "country": "Afghanistan",
        "iso2": "af",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Diplomatik, umuma mahsus, hizmet ve hususi pasaport hamilleri vizeye tabidir. Umuma mahsus, hizmet ve hususi pasaport hamili Afgan vatandaşları belirli koşulları karşılamak şartıyla e-Vizelerini www.evisa.gov.tr adresinden alabilmektedirler.",
            "en": "Diplomatic, ordinary, service and special passport holders are subject to a visa. Afghan citizens holding ordinary, service and special passports can obtain their e-Visas from www.evisa.gov.tr, provided that they meet certain conditions.",
            "de": "Inhaber eines Diplomaten-, Zivil-, Dienst- und Sonderpasses sind visumpflichtig. Afghanische Staatsbürger mit gewöhnlichen, Dienst- und Sonderpässen können ihre E-Visa unter www.evisa.gov.tr ​​erhalten, sofern sie bestimmte Bedingungen erfüllen."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/af.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Albania",
        "iso2": "al",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri, Türkiye’ye yapacakları turizm amaçlı seyahatleri veya transit geçişlerinde, Türkiye’de toplam ikamet süresi, ilk giriş tarihinden itibaren geçerli olacak şekilde, altı ay içerisinde 90 günü geçmemek kaydıyla vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for their tourism travels or transit passes to Turkey, provided that the total residence period in Turkey does not exceed 90 days within six months, valid from the date of first entry.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für ihre touristischen Reisen oder Transitpässe in die Türkei von der Visumpflicht befreit, sofern die Gesamtaufenthaltsdauer in der Türkei 90 Tage innerhalb von sechs Monaten nicht überschreitet, gültig ab dem Datum der ersten Einreise."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri, Türkiye’ye yapacakları turizm amaçlı seyahatleri veya transit geçişlerinde, Türkiye’de toplam ikamet süresi, ilk giriş tarihinden itibaren geçerli olacak şekilde, altı ay içerisinde 90 günü geçmemek kaydıyla vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for their tourism travels or transit passes to Turkey, provided that the total residence period in Turkey does not exceed 90 days within six months, valid from the date of first entry.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für ihre touristischen Reisen oder Transitpässe in die Türkei von der Visumpflicht befreit, sofern die Gesamtaufenthaltsdauer in der Türkei 90 Tage innerhalb von sechs Monaten nicht überschreitet, gültig ab dem Datum der ersten Einreise."
        },
        "flag": "https:\/\/flagcdn.com\/al.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Algeria",
        "iso2": "dz",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "15 yaşından küçük ve 65 yaşından büyük umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır. 15-18 ve 35-65 yaş aralığındaki umuma mahsus pasaport hamili Cezayir vatandaşları Schengen veya ABD, Birleşik Krallık, İrlanda geçerli vizesi veya geçerli ikamet izni hamili olmak ve belirli koşulları karşılamak şartıyla 30 gün süreli ve tek girişli vizelerini www.evisa.gov.tr internet adresinden e-vize olarak alabilmektedirler.",
            "en": "Ordinary passport holders under the age of 15 and over the age of 65 are exempt from visa for 90 days in every 180 days. Algerian citizens who are ordinary passport holders and between the ages of 15-18 and 35-65 can obtain their 30-day, single-entry visas as e-visas from the website www.evisa.gov.tr, provided that they have a valid Schengen visa or a valid residence permit from the USA, the United Kingdom, Ireland or a valid residence permit and meet certain conditions.",
            "de": "Normale Reisepassinhaber unter 15 Jahren und über 65 Jahren sind alle 180 Tage für 90 Tage von der Visumpflicht befreit. Algerische Staatsbürger, die einen gewöhnlichen Reisepass besitzen und zwischen 15 und 18 sowie zwischen 35 und 65 Jahre alt sind, können ihre 30-Tage-Visum für die einmalige Einreise als E-Visum auf der Website www.evisa.gov.tr ​​erhalten, sofern sie über ein gültiges Schengen-Visum oder eine gültige Aufenthaltserlaubnis aus den USA, dem Vereinigten Königreich, Irland oder einer gültigen Aufenthaltserlaubnis verfügen und bestimmte Bedingungen erfüllen."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 90 gün süreyle vizeden muaftır. 15 yaşından küçük ve 65 yaşından büyük umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır. 15-18 ve 35-65 yaş aralığındaki umuma mahsus pasaport hamili Cezayir vatandaşları Schengen veya ABD, Birleşik Krallık, İrlanda geçerli vizesi veya geçerli ikamet izni hamili olmak ve belirli koşulları karşılamak şartıyla 30 gün süreli ve tek girişli vizelerini www.evisa.gov.tr internet adresinden e-vize olarak alabilmektedirler.",
            "en": "Official passport holders are exempt from visa for 90 days. Ordinary passport holders under the age of 15 and over the age of 65 are exempt from visa for 90 days in every 180 days. Algerian citizens who are ordinary passport holders and between the ages of 15-18 and 35-65 can obtain their 30-day, single-entry visas as e-visas from the website www.evisa.gov.tr, provided that they have a valid Schengen visa or a valid residence permit from the USA, the United Kingdom, Ireland or a valid residence permit and meet certain conditions.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 90 Tage von der Visumpflicht befreit. Normale Reisepassinhaber unter 15 Jahren und über 65 Jahren sind alle 180 Tage für 90 Tage von der Visumpflicht befreit. Algerische Staatsbürger, die einen gewöhnlichen Reisepass besitzen und zwischen 15 und 18 sowie zwischen 35 und 65 Jahre alt sind, können ihre 30-Tage-Visum für die einmalige Einreise als E-Visum auf der Website www.evisa.gov.tr ​​erhalten, sofern sie über ein gültiges Schengen-Visum oder eine gültige Aufenthaltserlaubnis aus den USA, dem Vereinigten Königreich, Irland oder einer gültigen Aufenthaltserlaubnis verfügen und bestimmte Bedingungen erfüllen."
        },
        "flag": "https:\/\/flagcdn.com\/dz.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Andorra",
        "iso2": "ad",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmî Pasaport ve Umuma Mahsus Pasaport hamili Andora vatandaşları her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Andorra citizens holding Official Passport and Ordinary Passport are exempt from visa for 90 days in every 180 days.",
            "de": "Andorra-Bürger, die einen offiziellen Reisepass und einen gewöhnlichen Reisepass besitzen, sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmî Pasaport ve Umuma Mahsus Pasaport hamili Andora vatandaşları her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Andorra citizens holding Official Passport and Ordinary Passport are exempt from visa for 90 days in every 180 days.",
            "de": "Andorra-Bürger, die einen offiziellen Reisepass und einen gewöhnlichen Reisepass besitzen, sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ad.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Angola",
        "iso2": "ao",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamili Angola vatandaşları vizeye tabidir.",
            "en": "Angolan citizens holding ordinary passports are subject to a visa.",
            "de": "Angolanische Staatsbürger, die einen gewöhnlichen Reisepass besitzen, sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik ve hizmet pasaportu hamili Angola vatandaşları her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Angolan citizens holding diplomatic and service passports are exempt from visa for 90 days in every 180 days.",
            "de": "Angolanische Staatsbürger mit Diplomaten- und Dienstpässen sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ao.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Antigua and Barbuda",
        "iso2": "ag",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir. Umuma mahsus pasaport hamillerine 90 gün ikamet süreli müteaddit giriş vizeleri www.evisa.gov.tr internet adresinden e-Vize şeklinde veya dış temsilciliklerimizde resen veya sınır kapılarımızda bandrol tatbiki suretiyle verilir.",
            "en": "Official and ordinary passport holders are subject to a visa. Regular entry visas for ordinary passport holders with a residence period of 90 days are issued in the form of e-Visas on the website www.evisa.gov.tr ​​or ex officio at our foreign representative offices or by applying a banderol at our border gates.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht. Reguläre Einreisevisa für normale Passinhaber mit einer Aufenthaltsdauer von 90 Tagen werden in Form von E-Visa auf der Website www.evisa.gov.tr ​​​​oder von Amts wegen in unseren Auslandsvertretungen oder durch Anbringen einer Banderole an unseren Grenztoren ausgestellt."
        },
        "durations": {
            "tr": "Umuma mahsus pasaport hamillerine 90 gün ikamet süreli müteaddit giriş vizeleri www.evisa.gov.tr internet adresinden e-Vize şeklinde veya dış temsilciliklerimizde resen veya sınır kapılarımızda bandrol tatbiki suretiyle verilir.",
            "en": "Regular entry visas for ordinary passport holders with a residence period of 90 days are issued in the form of e-Visas on the website www.evisa.gov.tr ​​or ex officio at our foreign representative offices or by applying a banderol at our border gates.",
            "de": "Reguläre Einreisevisa für normale Passinhaber mit einer Aufenthaltsdauer von 90 Tagen werden in Form von E-Visa auf der Website www.evisa.gov.tr ​​​​oder von Amts wegen in unseren Auslandsvertretungen oder durch Anbringen einer Banderole an unseren Grenztoren ausgestellt."
        },
        "flag": "https:\/\/flagcdn.com\/ag.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Argentina",
        "iso2": "ar",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ar.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Armenia",
        "iso2": "am",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri de vizeye tabi olup, 30 güne kadar ikamet süreli turistik amaçlı müteaddit giriş vizelerini, www.evisa.gov.tr internet adresinden e-Vize şeklinde veya dış temsilciklerimizden alabilirler.",
            "en": "Ordinary passport holders are also subject to a visa, and they can obtain multiple entry visas for touristic purposes with a residence period of up to 30 days, in the form of e-Visas from the website www.evisa.gov.tr ​​or from our foreign representatives.",
            "de": "Inhaber eines normalen Reisepasses sind ebenfalls visumpflichtig und können auf der Website www.evisa.gov.tr ​​​​oder bei unseren Auslandsvertretungen Mehrfachvisa für touristische Zwecke mit einer Aufenthaltsdauer von bis zu 30 Tagen in Form von E-Visa erhalten."
        },
        "durations": {
            "tr": "Umuma mahsus pasaport hamilleri de vizeye tabi olup, 30 güne kadar ikamet süreli turistik amaçlı müteaddit giriş vizelerini, www.evisa.gov.tr internet adresinden e-Vize şeklinde veya dış temsilciklerimizden alabilirler.",
            "en": "Ordinary passport holders are also subject to a visa, and they can obtain multiple entry visas for touristic purposes with a residence period of up to 30 days, in the form of e-Visas from the website www.evisa.gov.tr ​​or from our foreign representatives.",
            "de": "Inhaber eines normalen Reisepasses sind ebenfalls visumpflichtig und können auf der Website www.evisa.gov.tr ​​​​oder bei unseren Auslandsvertretungen Mehrfachvisa für touristische Zwecke mit einer Aufenthaltsdauer von bis zu 30 Tagen in Form von E-Visa erhalten."
        },
        "flag": "https:\/\/flagcdn.com\/am.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Australia",
        "iso2": "au",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir. Umuma mahsus pasaport hamili Avustralya vatandaşları vizelerini www.evisa.gov.tr internet adresinden e-vize olarak veya sınır kapılarımızdan da alabilmektedirler.",
            "en": "Official and ordinary passport holders are subject to a visa. Australian citizens holding ordinary passports can obtain their visas as e-visas from the website www.evisa.gov.tr ​​or from our border gates.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht. Australische Staatsbürger mit gewöhnlichen Pässen können ihre Visa als E-Visa auf der Website www.evisa.gov.tr ​​​​oder an unseren Grenztoren erhalten."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/au.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Austria",
        "iso2": "at",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary and official passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary and official passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/at.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Azerbaijan",
        "iso2": "az",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/az.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Bahamas",
        "iso2": "bs",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri vizeye tabi olup, 90 gün ikamet süreli müteaddit giriş vizeleri www.evisa.gov.tr internet adresinden e-Vize olarak veya dış temsilciliklerimizde resen verilir.",
            "en": "Ordinary passport holders are subject to a visa, and multiple entry visas for 90 days of residence are issued as e-Visas on the website www.evisa.gov.tr ​​or ex officio at our foreign representative offices.",
            "de": "Inhaber eines gewöhnlichen Reisepasses sind visumpflichtig, und Visa für die mehrfache Einreise mit einem Aufenthalt von 90 Tagen werden als E-Visa auf der Website www.evisa.gov.tr ​​​​oder von Amts wegen in unseren Auslandsvertretungen ausgestellt."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 90 gün süreyle vizeden muaftır. Umuma mahsus pasaport hamilleri vizeye tabi olup, 90 gün ikamet süreli müteaddit giriş vizeleri www.evisa.gov.tr internet adresinden e-Vize olarak veya dış temsilciliklerimizde resen verilir.",
            "en": "Official passport holders are exempt from visa for 90 days. Ordinary passport holders are subject to a visa, and multiple entry visas for 90 days of residence are issued as e-Visas on the website www.evisa.gov.tr ​​or ex officio at our foreign representative offices.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 90 Tage von der Visumpflicht befreit. Inhaber eines gewöhnlichen Reisepasses sind visumpflichtig, und Visa für die mehrfache Einreise mit einem Aufenthalt von 90 Tagen werden als E-Visa auf der Website www.evisa.gov.tr ​​​​oder von Amts wegen in unseren Auslandsvertretungen ausgestellt."
        },
        "flag": "https:\/\/flagcdn.com\/bs.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Bahrain",
        "iso2": "bh",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamili Bahreyn vatandaşları ülkemize yapacakları turistik amaçlı seyahatlerde her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Bahraini citizens holding ordinary passports are exempt from visa for 90 days in every 180 days for their touristic trips to our country.",
            "de": "Bahrainische Staatsbürger, die einen gewöhnlichen Reisepass besitzen, sind für ihre touristischen Reisen in unser Land alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi pasaport hamili Bahreyn vatandaşları 15 güne kadar ikamet süreli vizelerini sınır kapılarında alabilmektedirler. Umuma mahsus pasaport hamili Bahreyn vatandaşları ülkemize yapacakları turistik amaçlı seyahatlerde her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Bahraini citizens with official passports can obtain their visas for up to 15 days at the border gates. Bahraini citizens holding ordinary passports are exempt from visa for 90 days in every 180 days for their touristic trips to our country.",
            "de": "Bahrainische Staatsbürger mit offiziellen Reisepässen können an den Grenztoren ihr Visum für bis zu 15 Tage erhalten. Bahrainische Staatsbürger, die einen gewöhnlichen Reisepass besitzen, sind für ihre touristischen Reisen in unser Land alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/bh.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Bangladesh",
        "iso2": "bd",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri vizeye tabidir. Umuma mahsus pasaport hamili Bangladeş vatandaşları, Schengen ülkeleri veya ABD, Birleşik Krallık, İrlanda’nın geçerli vize veya geçerli ikamet izni hamili olmak ve belirli koşulları karşılamak şartıyla vizelerini www.evisa.gov.tr internet sitesinden e-vize olarak alabilmektedirler.",
            "en": "Ordinary passport holders are subject to a visa. Bangladeshi citizens holding ordinary passports can obtain their visas as e-visas from the website www.evisa.gov.tr, provided that they are holders of a valid visa or residence permit of the Schengen countries or the USA, the United Kingdom, Ireland and meet certain conditions.",
            "de": "Inhaber eines normalen Reisepasses sind visumpflichtig. Bangladeschische Staatsbürger mit gewöhnlichen Pässen können ihre Visa als E-Visa auf der Website www.evisa.gov.tr ​​erhalten, sofern sie Inhaber eines gültigen Visums oder einer Aufenthaltserlaubnis der Schengen-Staaten oder der USA, des Vereinigten Königreichs und Irlands sind und bestimmte Voraussetzungen erfüllen."
        },
        "durations": {
            "tr": "Diplomatik ve resmi\/hizmet pasaportu hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Diplomatic and official\/service passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Diplomaten- und Beamten-\/Dienstpassinhaber sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/bd.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Barbados",
        "iso2": "bb",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri vizeye tabidir ve 90 gün ikamet süreli müteaddit giriş vizeleri www.evisa.gov.tr internet adresinden e-Vize olarak veya dış temsilciliklerimizde resen verilir.",
            "en": "Ordinary passport holders are subject to a visa, and multiple entry visas for 90 days of residence are issued as e-Visas on the website www.evisa.gov.tr ​​or ex officio at our foreign representative offices.",
            "de": "Inhaber eines gewöhnlichen Reisepasses sind visumpflichtig, und Visa für die mehrfache Einreise mit einem Aufenthalt von 90 Tagen werden als E-Visa auf der Website www.evisa.gov.tr ​​​​oder von Amts wegen in unseren Auslandsvertretungen ausgestellt."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 90 gün süreyle vizeden muaftır. Umuma mahsus pasaport hamilleri vizeye tabidir ve 90 gün ikamet süreli müteaddit giriş vizeleri www.evisa.gov.tr internet adresinden e-Vize olarak veya dış temsilciliklerimizde resen verilir.",
            "en": "Official passport holders are exempt from visa for 90 days. Ordinary passport holders are subject to a visa, and multiple entry visas for 90 days of residence are issued as e-Visas on the website www.evisa.gov.tr ​​or ex officio at our foreign representative offices.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 90 Tage von der Visumpflicht befreit. Inhaber eines gewöhnlichen Reisepasses sind visumpflichtig, und Visa für die mehrfache Einreise mit einem Aufenthalt von 90 Tagen werden als E-Visa auf der Website www.evisa.gov.tr ​​​​oder von Amts wegen in unseren Auslandsvertretungen ausgestellt."
        },
        "flag": "https:\/\/flagcdn.com\/bb.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Belarus",
        "iso2": "by",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 30 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 30 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 30 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 30 gün süreyle vizeden muaftır. Toplam kalış süresi ilk giriş tarihinden itibaren 1 yıl içerisinde 90 günü geçemez.",
            "en": "Official and ordinary passport holders are exempt from visa for 30 days. The total duration of stay cannot exceed 90 days within 1 year from the date of first entry.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 30 Tage von der Visumpflicht befreit. Die Gesamtaufenthaltsdauer darf 90 Tage innerhalb eines Jahres ab dem Datum der ersten Einreise nicht überschreiten."
        },
        "flag": "https:\/\/flagcdn.com\/by.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Belgium",
        "iso2": "be",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary and official passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary and official passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/be.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Belize",
        "iso2": "bz",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır. Toplam kalış süresi son 180 gün içerisinde 90 günü geçemez.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days. The total length of stay cannot exceed 90 days in the last 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit. Die Gesamtaufenthaltsdauer darf in den letzten 180 Tagen 90 Tage nicht überschreiten."
        },
        "flag": "https:\/\/flagcdn.com\/bz.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Benin",
        "iso2": "bj",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus, hizmet ve hususi pasaport hamilleri vizeye tabidir.",
            "en": "Holders of ordinary, service and special passports are subject to a visa.",
            "de": "Inhaber von gewöhnlichen, Dienst- und Sonderpässen sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamilleri 90 güne kadar ikamet süreli turistik veya resmi amaçlı seyahatlerinde ve transit geçişlerinde vizeden muaftır.",
            "en": "Diplomatic passport holders are exempt from visa for touristic or official travels and transits with a residence period of up to 90 days.",
            "de": "Inhaber eines Diplomatenpasses sind für touristische oder dienstliche Reisen und Transitreisen mit einer Aufenthaltsdauer von bis zu 90 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/bj.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Bhutan",
        "iso2": "bt",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir. Umuma mahsus pasaport hamillerine giriş vizeleri dış temsilciliklerimizce en fazla 15 gün ikamet süreli verilir.",
            "en": "Official and ordinary passport holders are subject to a visa. Entry visas for ordinary passport holders are issued by our foreign representative offices for a maximum residence period of 15 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht. Einreisevisa für normale Passinhaber werden von unseren Auslandsvertretungen für eine maximale Aufenthaltsdauer von 15 Tagen ausgestellt."
        },
        "durations": {
            "tr": "Umuma mahsus pasaport hamillerine giriş vizeleri dış temsilciliklerimizce en fazla 15 gün ikamet süreli verilir.",
            "en": "Entry visas for ordinary passport holders are issued by our foreign representative offices for a maximum residence period of 15 days.",
            "de": "Einreisevisa für normale Passinhaber werden von unseren Auslandsvertretungen für eine maximale Aufenthaltsdauer von 15 Tagen ausgestellt."
        },
        "flag": "https:\/\/flagcdn.com\/bt.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Bolivia, Plurinational State of",
        "iso2": "bo",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır. Toplam kalış süresi son 180 gün içerisinde 90 günü geçmez.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days. The total length of stay does not exceed 90 days in the last 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit. Die Gesamtaufenthaltsdauer darf in den letzten 180 Tagen 90 Tage nicht überschreiten."
        },
        "flag": "https:\/\/flagcdn.com\/bo.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Bosnia and Herzegovina",
        "iso2": "ba",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 180 gün içinde 90 günü aşmamak kaydıyla vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for a period not exceeding 90 days within 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für einen Zeitraum von höchstens 90 Tagen innerhalb von 180 Tagen von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 180 gün içinde 90 günü aşmamak kaydıyla vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for a period not exceeding 90 days within 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für einen Zeitraum von höchstens 90 Tagen innerhalb von 180 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ba.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Botswana",
        "iso2": "bw",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Official and ordinary passport holders are subject to a visa.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/bw.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Brazil",
        "iso2": "br",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri ise Türkiye'de son 180 gün içerisinde toplam kalış süresi 90 günü geçmemek kaydıyla, turizm ve iş amacıyla giriş ve transit vizesinden muaftır.",
            "en": "Ordinary passport holders are exempt from entry and transit visas for tourism and business purposes, provided that their total stay in Türkiye in the last 180 days does not exceed 90 days.",
            "de": "Normale Passinhaber sind von Einreise- und Transitvisa für touristische und geschäftliche Zwecke befreit, sofern ihr Gesamtaufenthalt in der Türkei in den letzten 180 Tagen 90 Tage nicht überschreitet."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 90 gün süreyle vizeden muaftır. Umuma mahsus pasaport hamilleri ise Türkiye'de son 180 gün içerisinde toplam kalış süresi 90 günü geçmemek kaydıyla, turizm ve iş amacıyla giriş ve transit vizesinden muaftır.",
            "en": "Official passport holders are exempt from visa for 90 days. Ordinary passport holders are exempt from entry and transit visas for tourism and business purposes, provided that their total stay in Türkiye in the last 180 days does not exceed 90 days.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 90 Tage von der Visumpflicht befreit. Normale Passinhaber sind von Einreise- und Transitvisa für touristische und geschäftliche Zwecke befreit, sofern ihr Gesamtaufenthalt in der Türkei in den letzten 180 Tagen 90 Tage nicht überschreitet."
        },
        "flag": "https:\/\/flagcdn.com\/br.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Brunei Darussalam",
        "iso2": "bn",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Diplomatik, resmi ve umuma mahsus pasaport hamilleri, ülkemize giriş ve transit geçişlerinde, ilk giriş tarihinden itibaren otuz (30) günü geçmeyen seyahatlerinde vizeden muaftırlar.",
            "en": "Diplomatic, official and ordinary passport holders are exempt from visa for their entry and transit passage into our country, and for their travels not exceeding thirty (30) days from the date of first entry.",
            "de": "Diplomaten-, Beamten- und gewöhnliche Reisepassinhaber sind für ihre Einreise und Durchreise in unser Land sowie für ihre Reisen, die dreißig (30) Tage ab dem Datum der ersten Einreise nicht überschreiten, von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/bn.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Bulgaria",
        "iso2": "bg",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Kimlik kartı ve umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Identity card and ordinary passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines Personalausweises und eines normalen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Kimlik kartı ve umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır. Diplomatik ve hizmet pasaportu hamilleri 30 güne kadar ikamet süreli turistik veya resmi amaçlı seyahatlerinde ve transit geçişlerinde vizeden muaftır.",
            "en": "Identity card and ordinary passport holders are exempt from visa for 90 days in every 180 days. Diplomatic and service passport holders are exempt from visa for their touristic or official travels and transit passages with a residence period of up to 30 days.",
            "de": "Inhaber eines Personalausweises und eines normalen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit. Diplomaten- und Dienstpassinhaber sind für ihre touristischen oder dienstlichen Reisen und Transitreisen mit einer Aufenthaltsdauer von bis zu 30 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/bg.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Burkina Faso",
        "iso2": "bf",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi\/hizmet ve umuma mahsus pasaport hamili Burkina Faso vatandaşları ise vizeye tabidir.",
            "en": "Burkina Faso citizens holding official\/service and ordinary passports are subject to a visa.",
            "de": "Staatsangehörige von Burkina Faso, die einen offiziellen\/dienstlichen oder gewöhnlichen Reisepass besitzen, sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamili Burkina Faso vatandaşları 90 güne kadar ikamet süreli seyahatlerinde vizeden muaftır.",
            "en": "Burkina Faso citizens holding diplomatic passports are exempt from visa for their travels with a residence period of up to 90 days.",
            "de": "Staatsangehörige Burkina Fasos, die einen Diplomatenpass besitzen, sind für Reisen mit einer Aufenthaltsdauer von bis zu 90 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/bf.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Burundi",
        "iso2": "bi",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Hususi, hizmet ve umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Special, service and ordinary passport holders are subject to a visa.",
            "de": "Inhaber eines Sonder-, Dienst- und gewöhnlichen Reisepasses sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik Pasaport Hamilleri her 180 gün içinde 90 günü aşmayan süre zarfında vizeden muaftır.",
            "en": "Diplomatic Passport Holders are exempt from visa for a period not exceeding 90 days in every 180 days.",
            "de": "Inhaber eines Diplomatenpasses sind für einen Zeitraum von höchstens 90 Tagen alle 180 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/bi.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Cabo Verde",
        "iso2": "cv",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri vizeye tabidir. Umuma mahsus pasaport hamili Yeşil Burun Adaları vatandaşları Schengen ülkeleri veya ABD, Birleşik Krallık, İrlanda geçerli vizesi veya geçerli ikamet izni hamili olmaları ve belirli şartları taşımaları koşuluyla, 30 güne kadar ikamet süreli tek giriş vizelerini www.evisa.gov.tr internet adresinden e-vize olarak alabilmektedirler.",
            "en": "Ordinary passport holders are subject to a visa. Citizens of Cape Verde who hold ordinary passports can obtain single entry visas with a residence period of up to 30 days as an e-visa from the website www.evisa.gov.tr, provided that they have a valid visa or a valid residence permit from the Schengen countries or the USA, the United Kingdom, Ireland and meet certain conditions.",
            "de": "Inhaber eines normalen Reisepasses sind visumpflichtig. Staatsbürger von Kap Verde, die im Besitz eines gewöhnlichen Reisepasses sind, können auf der Website www.evisa.gov.tr ​​ein einmaliges Einreisevisum mit einer Aufenthaltsdauer von bis zu 30 Tagen als E-Visum erhalten, sofern sie über ein gültiges Visum oder eine gültige Aufenthaltserlaubnis aus den Schengen-Staaten oder den USA, dem Vereinigten Königreich und Irland verfügen und bestimmte Bedingungen erfüllen."
        },
        "durations": {
            "tr": "Umuma mahsus pasaport hamili Yeşil Burun Adaları vatandaşları Schengen ülkeleri veya ABD, Birleşik Krallık, İrlanda geçerli vizesi veya geçerli ikamet izni hamili olmaları ve belirli şartları taşımaları koşuluyla, 30 güne kadar ikamet süreli tek giriş vizelerini www.evisa.gov.tr internet adresinden e-vize olarak alabilmektedirler.",
            "en": "Citizens of Cape Verde who hold ordinary passports can obtain single entry visas with a residence period of up to 30 days as an e-visa from the website www.evisa.gov.tr, provided that they have a valid visa or a valid residence permit from the Schengen countries or the USA, the United Kingdom, Ireland and meet certain conditions.",
            "de": "Staatsbürger von Kap Verde, die im Besitz eines gewöhnlichen Reisepasses sind, können auf der Website www.evisa.gov.tr ​​ein einmaliges Einreisevisum mit einer Aufenthaltsdauer von bis zu 30 Tagen als E-Visum erhalten, sofern sie über ein gültiges Visum oder eine gültige Aufenthaltserlaubnis aus den Schengen-Staaten oder den USA, dem Vereinigten Königreich und Irland verfügen und bestimmte Bedingungen erfüllen."
        },
        "flag": "https:\/\/flagcdn.com\/cv.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Cambodia",
        "iso2": "kh",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri de vizeye tabi olup istizan gerekir. Umuma mahsus pasaport hamillerine, transit vizeleri dış temsilciliklerimizce en fazla 7 gün ikamet süreli verilir.",
            "en": "Ordinary passport holders are also subject to a visa and require permission. Transit visas are issued to ordinary passport holders by our foreign representative offices for a maximum residence period of 7 days.",
            "de": "Auch normale Passinhaber sind visums- und genehmigungspflichtig. Transitvisa werden von unseren Auslandsvertretungen für Inhaber eines normalen Reisepasses für eine maximale Aufenthaltsdauer von 7 Tagen ausgestellt."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 30 gün süreyle vizeden muaftır.",
            "en": "Official passport holders are exempt from visa for 30 days.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 30 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/kh.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Cameroon",
        "iso2": "cm",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi heyet mensubu resmi pasaport (diplomatik, hizmet ve hususi) hamilleri 90 günü aşmamak kaydıyla vizeden muaftır. Resmi heyet mensubu olmayan Diplomatik, Hizmet ve Hususi Pasaport hamilleri vizeye tabidir.",
            "en": "Official passport holders (diplomatic, service and special) who are members of the official delegation are exempt from visa for a period not exceeding 90 days. Diplomatic, Service and Special Passport holders who are not members of the official delegation are subject to a visa.",
            "de": "Inhaber offizieller Reisepässe (Diplomaten-, Dienst- und Sonderpässe), die Mitglieder der offiziellen Delegation sind, sind für einen Zeitraum von höchstens 90 Tagen von der Visumpflicht befreit. Inhaber von Diplomaten-, Dienst- und Sonderpässen, die nicht Mitglieder der offiziellen Delegation sind, unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Resmi heyet mensubu resmi pasaport (diplomatik, hizmet ve hususi) hamilleri 90 günü aşmamak kaydıyla vizeden muaftır.",
            "en": "Official passport holders (diplomatic, service and special) who are members of the official delegation are exempt from visa for a period not exceeding 90 days.",
            "de": "Inhaber offizieller Reisepässe (Diplomaten-, Dienst- und Sonderpässe), die Mitglieder der offiziellen Delegation sind, sind für einen Zeitraum von höchstens 90 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/cm.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Canada",
        "iso2": "ca",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamili Kanada vatandaşları ülkemize yapacakları turistik amaçlı seyahatlerde her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Canadian citizens holding ordinary passports are exempt from visa for 90 days in every 180 days during their touristic trips to our country.",
            "de": "Kanadische Staatsbürger, die einen gewöhnlichen Reisepass besitzen, sind während ihrer touristischen Reisen in unser Land alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Umuma mahsus pasaport hamili Kanada vatandaşları ülkemize yapacakları turistik amaçlı seyahatlerde her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Canadian citizens holding ordinary passports are exempt from visa for 90 days in every 180 days during their touristic trips to our country.",
            "de": "Kanadische Staatsbürger, die einen gewöhnlichen Reisepass besitzen, sind während ihrer touristischen Reisen in unser Land alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ca.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Central African Republic",
        "iso2": "cf",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaportlar vizeye tabidir.",
            "en": "Official and ordinary passports are subject to visa.",
            "de": "Amtliche und gewöhnliche Reisepässe unterliegen der Visumpflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/cf.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Chad",
        "iso2": "td",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Ordinary passport holders are subject to a visa.",
            "de": "Inhaber eines normalen Reisepasses sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik ve resmi pasaport hamilleri 180 gün içinde 90 gün süreyle vizeden muaftır.",
            "en": "Diplomatic and official passport holders are exempt from visa for 90 days within 180 days.",
            "de": "Diplomaten- und Amtspassinhaber sind innerhalb von 180 Tagen für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/td.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Chile",
        "iso2": "cl",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/cl.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "China",
        "iso2": "cn",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri 30 güne kadar ikamet süreli tek girişli elektronik vizelerini www.evisa.gov.tr internet adresinden alabilmektedir.",
            "en": "Ordinary passport holders can obtain single-entry electronic visas for a residence period of up to 30 days from the website www.evisa.gov.tr.",
            "de": "Normale Passinhaber können auf der Website www.evisa.gov.tr ​​ein elektronisches Visum für die einmalige Einreise für einen Aufenthaltszeitraum von bis zu 30 Tagen erhalten."
        },
        "durations": {
            "tr": "Umuma mahsus pasaport hamilleri 30 güne kadar ikamet süreli tek girişli elektronik vizelerini www.evisa.gov.tr internet adresinden alabilmektedir. Resmi pasaport hamilleri 30 gün süreyle vizeden muaftır.",
            "en": "Ordinary passport holders can obtain single-entry electronic visas for a residence period of up to 30 days from the website www.evisa.gov.tr. Official passport holders are exempt from visa for 30 days.",
            "de": "Normale Passinhaber können auf der Website www.evisa.gov.tr ​​ein elektronisches Visum für die einmalige Einreise für einen Aufenthaltszeitraum von bis zu 30 Tagen erhalten. Inhaber eines offiziellen Reisepasses sind für 30 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/cn.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Colombia",
        "iso2": "co",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Diplomatik, resmi ve umuma mahsus pasaport hamili Kolombiya vatandaşları 90 güne kadar ikamet süreli seyahatlerinde vizeden muaftır.",
            "en": "Colombian citizens holding diplomatic, official and ordinary passports are exempt from visa for their travels with a residence period of up to 90 days.",
            "de": "Kolumbianische Staatsbürger mit Diplomaten-, Amts- und gewöhnlichen Pässen sind für Reisen mit einer Aufenthaltsdauer von bis zu 90 Tagen von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Diplomatik, resmi ve umuma mahsus pasaport hamili Kolombiya vatandaşları 90 güne kadar ikamet süreli seyahatlerinde vizeden muaftır.",
            "en": "Colombian citizens holding diplomatic, official and ordinary passports are exempt from visa for their travels with a residence period of up to 90 days.",
            "de": "Kolumbianische Staatsbürger mit Diplomaten-, Amts- und gewöhnlichen Pässen sind für Reisen mit einer Aufenthaltsdauer von bis zu 90 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/co.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Comoros",
        "iso2": "km",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir. Umuma mahsus pasaport hamillerine giriş vizeleri dış temsilciliklerimizce en fazla 15 gün, transit vizeleri ise en fazla 7 gün ikamet süreli verilir.",
            "en": "Official and ordinary passport holders are subject to a visa. Entry visas for ordinary passport holders are issued by our foreign representative offices for a maximum residence period of 15 days, and transit visas for a maximum residence period of 7 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht. Einreisevisa für normale Passinhaber werden von unseren Auslandsvertretungen für eine maximale Aufenthaltsdauer von 15 Tagen ausgestellt, Transitvisa für eine maximale Aufenthaltsdauer von 7 Tagen."
        },
        "durations": {
            "tr": "Umuma mahsus pasaport hamillerine giriş vizeleri dış temsilciliklerimizce en fazla 15 gün, transit vizeleri ise en fazla 7 gün ikamet süreli verilir.",
            "en": "Entry visas for ordinary passport holders are issued by our foreign representative offices for a maximum residence period of 15 days, and transit visas for a maximum residence period of 7 days.",
            "de": "Einreisevisa für normale Passinhaber werden von unseren Auslandsvertretungen für eine maximale Aufenthaltsdauer von 15 Tagen ausgestellt, Transitvisa für eine maximale Aufenthaltsdauer von 7 Tagen."
        },
        "flag": "https:\/\/flagcdn.com\/km.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Congo",
        "iso2": "cg",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi\/hizmet ve umuma mahsus pasaport hamili Kongo Cumhuriyeti vatandaşları ise vizeye tabidir.",
            "en": "Citizens of the Republic of Congo who hold official\/service and ordinary passports are subject to a visa.",
            "de": "Staatsangehörige der Republik Kongo, die im Besitz eines offiziellen\/dienstlichen oder gewöhnlichen Reisepasses sind, unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamili Kongo Cumhuriyeti vatandaşları, 90 güne kadar ikamet süreli seyahatlerinde vizeden muaftır.",
            "en": "Citizens of the Republic of Congo who hold a diplomatic passport are exempt from visa for their travels with a residence period of up to 90 days.",
            "de": "Staatsangehörige der Republik Kongo, die einen Diplomatenpass besitzen, sind für ihre Reisen mit einer Aufenthaltsdauer von bis zu 90 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/cg.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Costa Rica",
        "iso2": "cr",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 30 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 30 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 30 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 30 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 30 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 30 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/cr.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Croatia",
        "iso2": "hr",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary and official passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary and official passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/hr.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Cuba",
        "iso2": "cu",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri ise vizeye tabi olup, transit vizeleri dış temsilciliklerimizce en fazla 7 gün ikamet süreli verilir.",
            "en": "Ordinary passport holders are subject to a visa, and transit visas are issued by our foreign representative offices for a maximum residence period of 7 days.",
            "de": "Normale Passinhaber unterliegen der Visumspflicht, Transitvisa werden von unseren Auslandsvertretungen für eine maximale Aufenthaltsdauer von 7 Tagen ausgestellt."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official passport holders are exempt from visa for 90 days.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/cu.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Czechia",
        "iso2": "cz",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/cz.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Côte d'Ivoire",
        "iso2": "ci",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri de vizeye tabidir.",
            "en": "Ordinary passport holders are also subject to a visa.",
            "de": "Auch normale Passinhaber unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/ci.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Democratic People's Republic of Korea",
        "iso2": "kp",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus ve resmî pasaport hamilleri vizeye tabidir.",
            "en": "Ordinary and official passport holders are subject to a visa.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind visumpflichtig."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/kp.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Democratic Republic of the Congo",
        "iso2": "cd",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus ve hizmet pasaportu hamilleri vizeye tabidir.",
            "en": "Ordinary and service passport holders are subject to a visa.",
            "de": "Inhaber eines gewöhnlichen Reisepasses und eines Dienstpasses sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Diplomatic passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines Diplomatenpasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/cd.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Denmark",
        "iso2": "dk",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/dk.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Djibouti",
        "iso2": "dj",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri ise vizeye tabidir.",
            "en": "Ordinary passport holders are subject to a visa.",
            "de": "Inhaber eines normalen Reisepasses sind visumpflichtig."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official passport holders are exempt from visa for 90 days.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/dj.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Dominica",
        "iso2": "dm",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Official and ordinary passport holders are subject to a visa.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/dm.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Dominican Republic",
        "iso2": "do",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri vizeye tabi olup, vizelerini www.evisa.gov.tr internet adresinden e-vize olarak, dış temsilciliklerimizden veya sınır kapılarımızda bandrol tatbiki suretiyle alabilmektedirler.",
            "en": "Ordinary passport holders are subject to a visa and can obtain their visas as e-visas from the website www.evisa.gov.tr, by applying a banderol at our foreign representative offices or at our border gates.",
            "de": "Normale Passinhaber sind visumpflichtig und können ihre Visa als E-Visum auf der Website www.evisa.gov.tr ​​erhalten, indem sie in unseren Auslandsvertretungen oder an unseren Grenztoren eine Banderole beantragen."
        },
        "durations": {
            "tr": "Diplomatik ve resmî pasaport hamilleri 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Diplomatic and official passport holders are exempt from visa for 90 days in 180 days.",
            "de": "Diplomaten- und Amtspassinhaber sind für 90 Tage in 180 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/do.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Ecuador",
        "iso2": "ec",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi pasaport ve umuma mahsus pasaport hamilleri her 180 gün içinde 90 gün süreyle vizeden muaftır.",
            "en": "Official passport and ordinary passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines offiziellen Reisepasses und eines gewöhnlichen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi pasaport ve umuma mahsus pasaport hamilleri her 180 gün içinde 90 gün süreyle vizeden muaftır.",
            "en": "Official passport and ordinary passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines offiziellen Reisepasses und eines gewöhnlichen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ec.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Egypt",
        "iso2": "eg",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamili Mısır vatandaşları vizeye tabidir. 15-45 yaş arasındaki umuma mahsus pasaport hamili Mısır vatandaşları Schengen veya ABD, Birleşik Krallık, İrlanda geçerli vizesine veya ikamet iznine sahip olmaları ve Türk Hava Yolları, AJet, Pegasus, Egypt Air veya Air Cairo ile seyahat etmeleri kaydıyla www.evisa.gov.tr internet adresinden 30 gün ikamet süreli tek girişli e-Vizelerini alabilirler.",
            "en": "Egyptian citizens holding ordinary passports are subject to a visa. Ordinary passport holder Egyptian citizens between the ages of 15-45 can obtain their single-entry e-Visa with a 30-day residence period from the website www.evisa.gov.tr, provided that they have a valid Schengen visa or residence permit from the USA, the United Kingdom, Ireland and travel with Turkish Airlines, AJet, Pegasus, Egypt Air or Air Cairo.",
            "de": "Ägyptische Staatsbürger, die einen gewöhnlichen Reisepass besitzen, sind visumpflichtig. Ägyptische Staatsbürger im Alter zwischen 15 und 45 Jahren, die einen normalen Reisepass besitzen, können ihr E-Visum für die einmalige Einreise mit einer Aufenthaltsdauer von 30 Tagen auf der Website www.evisa.gov.tr ​​erhalten, sofern sie über ein gültiges Schengen-Visum oder eine Aufenthaltserlaubnis aus den USA, dem Vereinigten Königreich oder Irland verfügen und mit Turkish Airlines, AJet, Pegasus, Egypt Air oder Air Cairo reisen."
        },
        "durations": {
            "tr": "Resmi pasaport hamili Mısır vatandaşları 90 gün süreyle vizeden muaftır. 15-45 yaş arasındaki umuma mahsus pasaport hamili Mısır vatandaşları Schengen veya ABD, Birleşik Krallık, İrlanda geçerli vizesine veya ikamet iznine sahip olmaları ve Türk Hava Yolları, AJet, Pegasus, Egypt Air veya Air Cairo ile seyahat etmeleri kaydıyla www.evisa.gov.tr internet adresinden 30 gün ikamet süreli tek girişli e-Vizelerini alabilirler.",
            "en": "Egyptian citizens holding official passports are exempt from visa for 90 days. Ordinary passport holder Egyptian citizens between the ages of 15-45 can obtain their single-entry e-Visa with a 30-day residence period from the website www.evisa.gov.tr, provided that they have a valid Schengen visa or residence permit from the USA, the United Kingdom, Ireland and travel with Turkish Airlines, AJet, Pegasus, Egypt Air or Air Cairo.",
            "de": "Ägyptische Staatsbürger, die einen offiziellen Reisepass besitzen, sind 90 Tage lang von der Visumpflicht befreit. Ägyptische Staatsbürger im Alter zwischen 15 und 45 Jahren, die einen normalen Reisepass besitzen, können ihr E-Visum für die einmalige Einreise mit einer Aufenthaltsdauer von 30 Tagen auf der Website www.evisa.gov.tr ​​erhalten, sofern sie über ein gültiges Schengen-Visum oder eine Aufenthaltserlaubnis aus den USA, dem Vereinigten Königreich oder Irland verfügen und mit Turkish Airlines, AJet, Pegasus, Egypt Air oder Air Cairo reisen."
        },
        "flag": "https:\/\/flagcdn.com\/eg.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "El Salvador",
        "iso2": "sv",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/sv.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Equatorial Guinea",
        "iso2": "gq",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamili Ekvator Ginesi vatandaşları vizeye tabidir. Umuma mahsus pasaport hamili Ekvator Ginesi vatandaşları Schengen ülkeleri veya ABD, Birleşik Krallık, İrlanda geçerli vizesi veya geçerli ikamet izni hamili olmaları ve belirli şartları taşımaları koşuluyla, 30 güne kadar ikamet süreli tek giriş vizelerini www.evisa.gov.tr internet adresinden e-vize olarak alabilmektedirler.",
            "en": "Equatorial Guinea citizens holding ordinary passports are subject to a visa. Citizens of Equatorial Guinea who hold ordinary passports can obtain single entry visas with a residence period of up to 30 days as an e-visa from the website www.evisa.gov.tr, provided that they have a valid visa or a valid residence permit from Schengen countries or the USA, the United Kingdom, Ireland and meet certain conditions.",
            "de": "Für Bürger Äquatorialguineas, die einen gewöhnlichen Reisepass besitzen, ist ein Visum erforderlich. Staatsangehörige Äquatorialguineas, die über einen gewöhnlichen Reisepass verfügen, können auf der Website www.evisa.gov.tr ​​ein einmaliges Einreisevisum mit einer Aufenthaltsdauer von bis zu 30 Tagen als E-Visum erhalten, sofern sie über ein gültiges Visum oder eine gültige Aufenthaltserlaubnis aus Schengen-Staaten oder den USA, dem Vereinigten Königreich und Irland verfügen und bestimmte Bedingungen erfüllen."
        },
        "durations": {
            "tr": "Umuma mahsus pasaport hamili Ekvator Ginesi vatandaşları Schengen ülkeleri veya ABD, Birleşik Krallık, İrlanda geçerli vizesi veya geçerli ikamet izni hamili olmaları ve belirli şartları taşımaları koşuluyla, 30 güne kadar ikamet süreli tek giriş vizelerini www.evisa.gov.tr internet adresinden e-vize olarak alabilmektedirler. Diplomatik, resmî ve hizmet pasaportu hamili Ekvator Ginesi vatandaşları her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Citizens of Equatorial Guinea who hold ordinary passports can obtain single entry visas with a residence period of up to 30 days as an e-visa from the website www.evisa.gov.tr, provided that they have a valid visa or a valid residence permit from Schengen countries or the USA, the United Kingdom, Ireland and meet certain conditions. Equatorial Guinea citizens holding diplomatic, official and service passports are exempt from visa for 90 days in every 180 days.",
            "de": "Staatsangehörige Äquatorialguineas, die über einen gewöhnlichen Reisepass verfügen, können auf der Website www.evisa.gov.tr ​​ein einmaliges Einreisevisum mit einer Aufenthaltsdauer von bis zu 30 Tagen als E-Visum erhalten, sofern sie über ein gültiges Visum oder eine gültige Aufenthaltserlaubnis aus Schengen-Staaten oder den USA, dem Vereinigten Königreich und Irland verfügen und bestimmte Bedingungen erfüllen. Bürger Äquatorialguineas, die einen Diplomaten-, Amts- oder Dienstpass besitzen, sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/gq.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Eritrea",
        "iso2": "er",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Official and ordinary passport holders are subject to a visa.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/er.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Estonia",
        "iso2": "ee",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri, Türkiye’de ikamet süresi her giriş için 90 günü geçmeyen turistik amaçlı seyahatlerinde vizeden muaftır.",
            "en": "Ordinary passport holders are exempt from visa for touristic travels whose residence period in Turkey does not exceed 90 days for each entry.",
            "de": "Normale Reisepassinhaber sind für touristische Reisen, deren Aufenthaltsdauer in der Türkei 90 Tage pro Einreise nicht überschreitet, von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamilleri, 90 güne kadar ikamet süreli turistik veya resmi amaçlı seyahatlerinde ve transit geçişlerinde vizeden muaftır. Umuma mahsus pasaport hamilleri, Türkiye’de ikamet süresi her giriş için 90 günü geçmeyen turistik amaçlı seyahatlerinde vizeden muaftır.",
            "en": "Diplomatic passport holders are exempt from visa for touristic or official travels and transits with a residence period of up to 90 days. Ordinary passport holders are exempt from visa for touristic travels whose residence period in Turkey does not exceed 90 days for each entry.",
            "de": "Inhaber eines Diplomatenpasses sind für touristische oder dienstliche Reisen und Transitreisen mit einer Aufenthaltsdauer von bis zu 90 Tagen von der Visumpflicht befreit. Normale Reisepassinhaber sind für touristische Reisen, deren Aufenthaltsdauer in der Türkei 90 Tage pro Einreise nicht überschreitet, von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ee.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Eswatini",
        "iso2": "sz",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri vizeye tabidir.",
            "en": "Ordinary and official passport holders are subject to a visa.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind visumpflichtig."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/sz.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Ethiopia",
        "iso2": "et",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi\/hizmet ve umuma mahsus pasaport hamili Etiyopya vatandaşları ise vizeye tabidir.",
            "en": "Ethiopian citizens holding official\/service and ordinary passports are subject to a visa.",
            "de": "Äthiopische Staatsbürger, die einen offiziellen\/dienstlichen und einen gewöhnlichen Reisepass besitzen, sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamili Etiyopya vatandaşları 90 güne kadar ikamet süreli seyahatlerinde vizeden muaftır.",
            "en": "Ethiopian citizens holding diplomatic passports are exempt from visa for their travels with a residence period of up to 90 days.",
            "de": "Äthiopische Staatsbürger, die einen Diplomatenpass besitzen, sind für Reisen mit einer Aufenthaltsdauer von bis zu 90 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/et.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Federated States of Micronesia",
        "iso2": "fm",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Official and ordinary passport holders are subject to a visa.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/fm.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Fiji",
        "iso2": "fj",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri vizeye tabidir. Umuma mahsus pasaport hamilleri vizelerini www.evisa.gov.tr internet adresinden e-vize olarak alabilmektedirler.",
            "en": "Ordinary passport holders are subject to a visa. Ordinary passport holders can obtain their visas as e-visas from the website www.evisa.gov.tr.",
            "de": "Inhaber eines normalen Reisepasses sind visumpflichtig. Normale Passinhaber können ihre Visa als E-Visa auf der Website www.evisa.gov.tr ​​erhalten."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines offiziellen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/fj.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Finland",
        "iso2": "fi",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır. Toplam kalış süresi son 180 gün içerisinde 90 günü geçmez.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days. The total length of stay does not exceed 90 days in the last 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit. Die Gesamtaufenthaltsdauer darf in den letzten 180 Tagen 90 Tage nicht überschreiten."
        },
        "flag": "https:\/\/flagcdn.com\/fi.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "France",
        "iso2": "fr",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/fr.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Gabon",
        "iso2": "ga",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Ordinary passport holders are subject to a visa.",
            "de": "Inhaber eines normalen Reisepasses sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik, hizmet ve resmî pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Diplomatic, service and official passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber von Diplomaten-, Dienst- und Dienstpässen sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ga.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Gambia",
        "iso2": "gm",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus, hizmet ve hususi pasaport hamilleri vizeye tabidir.",
            "en": "Holders of ordinary, service and special passports are subject to a visa.",
            "de": "Inhaber von gewöhnlichen, Dienst- und Sonderpässen sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamilleri 90 güne kadar ikamet süreli turistik veya resmi amaçlı seyahatlerinde ve transit geçişlerinde vizeden muaftır.",
            "en": "Diplomatic passport holders are exempt from visa for touristic or official travels and transits with a residence period of up to 90 days.",
            "de": "Inhaber eines Diplomatenpasses sind für touristische oder dienstliche Reisen und Transitreisen mit einer Aufenthaltsdauer von bis zu 90 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/gm.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Georgia",
        "iso2": "ge",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ge.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Germany",
        "iso2": "de",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmî Pasaport ve Umuma Mahsus Pasaport hamili Alman vatandaşları her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "German citizens holding Official Passport and Ordinary Passport are exempt from visa for 90 days in every 180 days.",
            "de": "Deutsche Staatsbürger, die einen amtlichen Reisepass und einen gewöhnlichen Reisepass besitzen, sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmî Pasaport ve Umuma Mahsus Pasaport hamili Alman vatandaşları her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "German citizens holding Official Passport and Ordinary Passport are exempt from visa for 90 days in every 180 days.",
            "de": "Deutsche Staatsbürger, die einen amtlichen Reisepass und einen gewöhnlichen Reisepass besitzen, sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/de.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Ghana",
        "iso2": "gh",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaportlar hamilleri vizeye tabidir.",
            "en": "Holders of official and ordinary passports are subject to a visa.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Diplomatic passport holders are exempt from visa for 90 days.",
            "de": "Inhaber eines Diplomatenpasses sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/gh.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Greece",
        "iso2": "gr",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri her 180 gün içinde 90 güne kadar vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for up to 90 days in every 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind alle 180 Tage für bis zu 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri her 180 gün içinde 90 güne kadar vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for up to 90 days in every 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind alle 180 Tage für bis zu 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/gr.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Guatemala",
        "iso2": "gt",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/gt.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Guinea",
        "iso2": "gn",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi\/hizmet ve umuma mahsus pasaport hamili Gine vatandaşları ise vizeye tabidir.",
            "en": "Guinean citizens holding official\/service and ordinary passports are subject to a visa.",
            "de": "Für guineische Staatsbürger, die einen offiziellen\/dienstlichen oder gewöhnlichen Reisepass besitzen, ist ein Visum erforderlich."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamili Gine vatandaşları, 90 güne kadar ikamet süreli seyahatlerinde vizeden muaftır.",
            "en": "Guinean citizens holding diplomatic passports are exempt from visa for their travels with a residence period of up to 90 days.",
            "de": "Guineische Staatsbürger, die einen Diplomatenpass besitzen, sind für Reisen mit einer Aufenthaltsdauer von bis zu 90 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/gn.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Guinea-Bissau",
        "iso2": "gw",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Ordinary passport holders are subject to a visa.",
            "de": "Inhaber eines normalen Reisepasses sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik ve resmî pasaport hamili Gine Bissau vatandaşları her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Guinea Bissau citizens holding diplomatic and official passports are exempt from visa for 90 days in every 180 days.",
            "de": "Staatsangehörige Guinea-Bissaus, die einen Diplomaten- oder Amtspass besitzen, sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/gw.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Guyana",
        "iso2": "gy",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri de vizeye tabi olup, giriş vizeleri dış temsilciliklerimizce en fazla 15 gün ikamet süreli verilir.",
            "en": "Ordinary passport holders are also subject to a visa, and entry visas are issued by our foreign representative offices for a maximum residence period of 15 days.",
            "de": "Auch normale Passinhaber unterliegen der Visumspflicht, Einreisevisa werden von unseren Auslandsvertretungen für eine maximale Aufenthaltsdauer von 15 Tagen ausgestellt."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 180 gün içerisinde toplam kalış süresi 90 günü aşmamak kaydıyla ülkemize yapacakları seyahatlerinde vizeden muaftır. Umuma mahsus pasaport hamilleri de vizeye tabi olup, giriş vizeleri dış temsilciliklerimizce en fazla 15 gün ikamet süreli verilir.",
            "en": "Official passport holders are exempt from visa for their travels to our country, provided that the total stay within 180 days does not exceed 90 days. Ordinary passport holders are also subject to a visa, and entry visas are issued by our foreign representative offices for a maximum residence period of 15 days.",
            "de": "Inhaber offizieller Reisepässe sind für ihre Reisen in unser Land von der Visumpflicht befreit, sofern der Gesamtaufenthalt innerhalb von 180 Tagen 90 Tage nicht überschreitet. Auch normale Passinhaber unterliegen der Visumspflicht, Einreisevisa werden von unseren Auslandsvertretungen für eine maximale Aufenthaltsdauer von 15 Tagen ausgestellt."
        },
        "flag": "https:\/\/flagcdn.com\/gy.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Haiti",
        "iso2": "ht",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Official and ordinary passport holders are subject to a visa.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/ht.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Honduras",
        "iso2": "hn",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/hn.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Hong Kong SAR",
        "iso2": "hk",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus “Hong Kong Special Administrative Region of the People’s Republic of China (SAR)” pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary \"Hong Kong Special Administrative Region of the People's Republic of China (SAR)\" passport holders are exempt from visa for 90 days.",
            "de": "Offizielle und gewöhnliche Passinhaber der „Sonderverwaltungsregion Hongkong der Volksrepublik China (SAR)“ sind 90 Tage lang von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus “Hong Kong Special Administrative Region of the People’s Republic of China (SAR)” pasaport hamilleri 90 gün süreyle vizeden muaftır. “British National Overseas” pasaportu hamili Hong Kong vatandaşları vizeye tabi olup, 90 gün ikamet süreli çok girişli vizelerini www.evisa.gov.tr internet adresinden e-Vize olarak alabilirler.",
            "en": "Official and ordinary \"Hong Kong Special Administrative Region of the People's Republic of China (SAR)\" passport holders are exempt from visa for 90 days. Hong Kong citizens holding a \"British National Overseas\" passport are subject to a visa and can obtain their 90-day multiple-entry visa as an e-Visa from the website www.evisa.gov.tr.",
            "de": "Offizielle und gewöhnliche Passinhaber der „Sonderverwaltungsregion Hongkong der Volksrepublik China (SAR)“ sind 90 Tage lang von der Visumpflicht befreit. Bürger Hongkongs, die einen „British National Overseas“-Pass besitzen, sind visumpflichtig und können ihr 90-Tage-Visum für die mehrfache Einreise als E-Visum auf der Website www.evisa.gov.tr ​​erhalten."
        },
        "flag": "https:\/\/flagcdn.com\/hk.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Hungary",
        "iso2": "hu",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır. Macaristan vatandaşları geçerli ulusal kimlik kartıyla her 180 günde 90 gün süreyle vizesiz giriş yapabilmektedirler.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days in every 180 days. Hungarian citizens can enter visa-free for 90 days every 180 days with a valid national identity card.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind alle 180 Tage für 90 Tage von der Visumpflicht befreit. Ungarische Staatsbürger können mit einem gültigen Personalausweis alle 180 Tage für 90 Tage visumfrei einreisen."
        },
        "flag": "https:\/\/flagcdn.com\/hu.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Iceland",
        "iso2": "is",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/is.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "India",
        "iso2": "in",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Hizmet, hususi ve umuma mahsus pasaport hamilleri vizeye tabidir ve Schengen ülkeleri veya ABD, Birleşik Krallık, İrlanda geçerli vizesi veya geçerli ikamet izni hamillerine, belirli şartları taşımaları koşuluyla, 30 güne kadar ikamet süreli tek giriş vizesi www.evisa.gov.tr internet adresinden e-Vize olarak ita edilmektedir. Umuma mahsus pasaport hamillerine transit vizesi dış temsilciliklerimizce en fazla 3 gün ikamet süreli verilir.",
            "en": "Service, special and ordinary passport holders are subject to a visa, and a single entry visa with a residence period of up to 30 days is issued as an e-Visa on the website www.evisa.gov.tr ​​for holders of a valid visa or valid residence permit of the Schengen countries or the USA, the United Kingdom, Ireland, provided that they meet certain conditions. Transit visas are issued to ordinary passport holders by our foreign representative offices for a maximum stay of 3 days.",
            "de": "Inhaber eines Dienst-, Sonder- und gewöhnlichen Reisepasses sind visumpflichtig, und ein einmaliges Einreisevisum mit einer Aufenthaltsdauer von bis zu 30 Tagen wird als E-Visum auf der Website www.evisa.gov.tr ​​​​für Inhaber eines gültigen Visums oder einer gültigen Aufenthaltserlaubnis der Schengen-Staaten oder der USA, des Vereinigten Königreichs und Irlands ausgestellt, sofern sie bestimmte Bedingungen erfüllen. Transitvisa werden von unseren Auslandsvertretungen für Inhaber eines normalen Reisepasses für einen maximalen Aufenthalt von 3 Tagen ausgestellt."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamilleri 90 gün süreyle turistik veya resmi amaçlı seyahatlerinde ve transit geçişlerinde vizeden muaftır. Hizmet, hususi ve umuma mahsus pasaport hamilleri vizeye tabidir ve Schengen ülkeleri veya ABD, Birleşik Krallık, İrlanda geçerli vizesi veya geçerli ikamet izni hamillerine, belirli şartları taşımaları koşuluyla, 30 güne kadar ikamet süreli tek giriş vizesi www.evisa.gov.tr internet adresinden e-Vize olarak ita edilmektedir.",
            "en": "Diplomatic passport holders are exempt from visa for touristic or official travels and transit passages for 90 days. Service, special and ordinary passport holders are subject to a visa, and a single entry visa with a residence period of up to 30 days is issued as an e-Visa on the website www.evisa.gov.tr ​​for holders of a valid visa or valid residence permit of the Schengen countries or the USA, the United Kingdom, Ireland, provided that they meet certain conditions.",
            "de": "Inhaber eines Diplomatenpasses sind für 90 Tage von der Visumpflicht für touristische oder offizielle Reisen und Transitreisen befreit. Inhaber eines Dienst-, Sonder- und gewöhnlichen Reisepasses sind visumpflichtig, und ein einmaliges Einreisevisum mit einer Aufenthaltsdauer von bis zu 30 Tagen wird als E-Visum auf der Website www.evisa.gov.tr ​​​​für Inhaber eines gültigen Visums oder einer gültigen Aufenthaltserlaubnis der Schengen-Staaten oder der USA, des Vereinigten Königreichs und Irlands ausgestellt, sofern sie bestimmte Bedingungen erfüllen."
        },
        "flag": "https:\/\/flagcdn.com\/in.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Indonesia",
        "iso2": "id",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamili Endonezya vatandaşları her 180 günde 90 günü aşmamak şartıyla 30 güne kadar süreyle vizeden muaftır.",
            "en": "Indonesian citizens holding ordinary passports are exempt from visa for up to 30 days, provided that it does not exceed 90 days in every 180 days.",
            "de": "Indonesische Staatsbürger, die einen normalen Reisepass besitzen, sind für bis zu 30 Tage von der Visumpflicht befreit, vorausgesetzt, dass die Visumdauer alle 180 Tage 90 Tage nicht überschreitet."
        },
        "durations": {
            "tr": "Umuma mahsus pasaport hamili Endonezya vatandaşları her 180 günde 90 günü aşmamak şartıyla 30 güne kadar süreyle vizeden muaftır. Diplomatik ve resmi\/hizmet pasaport hamili Endonezya vatandaşları 30 güne kadar ikamet süreli seyahatlerinde vizeden muaftır.",
            "en": "Indonesian citizens holding ordinary passports are exempt from visa for up to 30 days, provided that it does not exceed 90 days in every 180 days. Indonesian citizens holding diplomatic and official\/service passports are exempt from visa for their travels with a residence period of up to 30 days.",
            "de": "Indonesische Staatsbürger, die einen normalen Reisepass besitzen, sind für bis zu 30 Tage von der Visumpflicht befreit, vorausgesetzt, dass die Visumdauer alle 180 Tage 90 Tage nicht überschreitet. Indonesische Staatsbürger mit Diplomaten- und Amts-\/Dienstpässen sind für Reisen mit einer Aufenthaltsdauer von bis zu 30 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/id.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Iran, Islamic Republic of",
        "iso2": "ir",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ir.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Iraq",
        "iso2": "iq",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Irak’ın 15 yaşından küçük ve 50 yaşından büyük umuma mahsus pasaport hamili vatandaşları her 180 günde 90 gün süreyle vizeden muaftır. 15-50 yaş arasındaki umuma mahsus pasaport hamili Irak vatandaşları Schengen ülkeleri veya ABD, Birleşik Krallık, İrlanda geçerli vizesi veya geçerli ikamet izni hamili olmak ve belirli koşulları karşılamak şartıyla, 30 güne kadar ikamet süreli tek giriş vizelerini www.evisa.gov.tr internet adresinden e-Vize olarak alabilmektedirler.",
            "en": "Citizens of Iraq who are under 15 years old and over 50 years old with ordinary passports are exempt from visa for 90 days in every 180 days. Iraqi citizens between the ages of 15 and 50 who are ordinary passport holders can obtain single entry visas with a residence period of up to 30 days as an e-Visa from the website www.evisa.gov.tr, provided that they have a valid visa or a valid residence permit from the Schengen countries or the USA, the United Kingdom, Ireland and meet certain conditions.",
            "de": "Irakische Staatsbürger, die unter 15 und über 50 Jahre alt sind und einen normalen Reisepass besitzen, sind alle 180 Tage für 90 Tage von der Visumpflicht befreit. Irakische Staatsbürger im Alter zwischen 15 und 50 Jahren, die einen gewöhnlichen Reisepass besitzen, können auf der Website www.evisa.gov.tr ​​ein einmaliges Einreisevisum mit einer Aufenthaltsdauer von bis zu 30 Tagen als E-Visum erhalten, sofern sie über ein gültiges Visum oder eine gültige Aufenthaltserlaubnis aus den Schengen-Staaten oder den USA, dem Vereinigten Königreich und Irland verfügen und bestimmte Voraussetzungen erfüllen."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır. Irak’ın 15 yaşından küçük ve 50 yaşından büyük umuma mahsus pasaport hamili vatandaşları her 180 günde 90 gün süreyle vizeden muaftır. 15-50 yaş arasındaki umuma mahsus pasaport hamili Irak vatandaşları Schengen ülkeleri veya ABD, Birleşik Krallık, İrlanda geçerli vizesi veya geçerli ikamet izni hamili olmak ve belirli koşulları karşılamak şartıyla, 30 güne kadar ikamet süreli tek giriş vizelerini www.evisa.gov.tr internet adresinden e-Vize olarak alabilmektedirler.",
            "en": "Official passport holders are exempt from visa for 90 days in every 180 days. Citizens of Iraq who are under 15 years old and over 50 years old with ordinary passports are exempt from visa for 90 days in every 180 days. Iraqi citizens between the ages of 15 and 50 who are ordinary passport holders can obtain single entry visas with a residence period of up to 30 days as an e-Visa from the website www.evisa.gov.tr, provided that they have a valid visa or a valid residence permit from the Schengen countries or the USA, the United Kingdom, Ireland and meet certain conditions.",
            "de": "Inhaber eines offiziellen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit. Irakische Staatsbürger, die unter 15 und über 50 Jahre alt sind und einen normalen Reisepass besitzen, sind alle 180 Tage für 90 Tage von der Visumpflicht befreit. Irakische Staatsbürger im Alter zwischen 15 und 50 Jahren, die einen gewöhnlichen Reisepass besitzen, können auf der Website www.evisa.gov.tr ​​ein einmaliges Einreisevisum mit einer Aufenthaltsdauer von bis zu 30 Tagen als E-Visum erhalten, sofern sie über ein gültiges Visum oder eine gültige Aufenthaltserlaubnis aus den Schengen-Staaten oder den USA, dem Vereinigten Königreich und Irland verfügen und bestimmte Voraussetzungen erfüllen."
        },
        "flag": "https:\/\/flagcdn.com\/iq.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Ireland",
        "iso2": "ie",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Normale Passinhaber sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır. Diplomatik pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary passport holders are exempt from visa for 90 days in every 180 days. Diplomatic passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Normale Passinhaber sind alle 180 Tage für 90 Tage von der Visumpflicht befreit. Inhaber eines Diplomatenpasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ie.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Israel",
        "iso2": "il",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/il.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Italy",
        "iso2": "it",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/it.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Jamaica",
        "iso2": "jm",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri ise vizeye tabidir ve 90 gün ikamet süreli müteaddit giriş vizeleri www.evisa.gov.tr internet adresinden e-Vize olarak veya dış temsilciliklerimizde resen verilir.",
            "en": "Ordinary passport holders are subject to a visa, and multiple entry visas with a residence period of 90 days are issued as e-Visas on the website www.evisa.gov.tr ​​or ex officio at our foreign representative offices.",
            "de": "Inhaber eines gewöhnlichen Reisepasses sind visumpflichtig, und Visa für die mehrfache Einreise mit einer Aufenthaltsdauer von 90 Tagen werden als E-Visa auf der Website www.evisa.gov.tr ​​​​oder von Amts wegen in unseren Auslandsvertretungen ausgestellt."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 90 gün süreyle vizeden muaftır. Umuma mahsus pasaport hamilleri ise vizeye tabidir ve 90 gün ikamet süreli müteaddit giriş vizeleri www.evisa.gov.tr internet adresinden e-Vize olarak veya dış temsilciliklerimizde resen verilir.",
            "en": "Official passport holders are exempt from visa for 90 days. Ordinary passport holders are subject to a visa, and multiple entry visas with a residence period of 90 days are issued as e-Visas on the website www.evisa.gov.tr ​​or ex officio at our foreign representative offices.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 90 Tage von der Visumpflicht befreit. Inhaber eines gewöhnlichen Reisepasses sind visumpflichtig, und Visa für die mehrfache Einreise mit einer Aufenthaltsdauer von 90 Tagen werden als E-Visa auf der Website www.evisa.gov.tr ​​​​oder von Amts wegen in unseren Auslandsvertretungen ausgestellt."
        },
        "flag": "https:\/\/flagcdn.com\/jm.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Japan",
        "iso2": "jp",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/jp.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Jordan",
        "iso2": "jo",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/jo.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Kazakhstan",
        "iso2": "kz",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmî ve umuma mahsus pasaport hamilleri her 180 gün içinde 90 güne kadar vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for up to 90 days in every 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind alle 180 Tage für bis zu 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmî ve umuma mahsus pasaport hamilleri her 180 gün içinde 90 güne kadar vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for up to 90 days in every 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind alle 180 Tage für bis zu 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/kz.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Kenya",
        "iso2": "ke",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri ise vizeye tabi olup, 90 güne kadar ikamet süreli müteaddit girişli vizeleri dış temsilciliklerimizde resen verilir.",
            "en": "Ordinary passport holders are subject to a visa, and multiple-entry visas with a residence period of up to 90 days are issued ex officio at our foreign representative offices.",
            "de": "Inhaber eines gewöhnlichen Reisepasses unterliegen der Visumspflicht, Visa für die mehrfache Einreise mit einer Aufenthaltsdauer von bis zu 90 Tagen werden von Amts wegen in unseren Auslandsvertretungen ausgestellt."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 90 gün süreyle vizeden muaftır. Umuma mahsus pasaport hamilleri ise vizeye tabi olup, 90 güne kadar ikamet süreli müteaddit girişli vizeleri dış temsilciliklerimizde resen verilir.",
            "en": "Official passport holders are exempt from visa for 90 days. Ordinary passport holders are subject to a visa, and multiple-entry visas with a residence period of up to 90 days are issued ex officio at our foreign representative offices.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 90 Tage von der Visumpflicht befreit. Inhaber eines gewöhnlichen Reisepasses unterliegen der Visumspflicht, Visa für die mehrfache Einreise mit einer Aufenthaltsdauer von bis zu 90 Tagen werden von Amts wegen in unseren Auslandsvertretungen ausgestellt."
        },
        "flag": "https:\/\/flagcdn.com\/ke.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Kiribati",
        "iso2": "ki",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabi olup istizan gerekir.",
            "en": "Official and ordinary passport holders are subject to a visa and permission is required.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visum- und Genehmigungspflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/ki.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Kosovo",
        "iso2": "xk",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri her altı ay için giriş tarihinden itibaren geçerli olacak şekilde 90 gün ikametli seyahatlerinde vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for their residential travels for 90 days, valid for every six months from the date of entry.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für ihre Wohnsitzreisen 90 Tage lang von der Visumpflicht befreit, gültig alle sechs Monate ab dem Datum der Einreise."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri her altı ay için giriş tarihinden itibaren geçerli olacak şekilde 90 gün ikametli seyahatlerinde vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for their residential travels for 90 days, valid for every six months from the date of entry.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für ihre Wohnsitzreisen 90 Tage lang von der Visumpflicht befreit, gültig alle sechs Monate ab dem Datum der Einreise."
        },
        "flag": "https:\/\/flagcdn.com\/xk.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Kuwait",
        "iso2": "kw",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri son 180 gün içerisinde toplam kalış süresi 90 günü geçmemek kaydıyla turistik amaçlı seyahatlerinde vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for their touristic travels, provided that the total stay in the last 180 days does not exceed 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für ihre touristischen Reisen von der Visumpflicht befreit, sofern der Gesamtaufenthalt in den letzten 180 Tagen 90 Tage nicht überschreitet."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri son 180 gün içerisinde toplam kalış süresi 90 günü geçmemek kaydıyla turistik amaçlı seyahatlerinde vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for their touristic travels, provided that the total stay in the last 180 days does not exceed 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für ihre touristischen Reisen von der Visumpflicht befreit, sofern der Gesamtaufenthalt in den letzten 180 Tagen 90 Tage nicht überschreitet."
        },
        "flag": "https:\/\/flagcdn.com\/kw.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Kyrgyzstan",
        "iso2": "kg",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri 180 gün içinde 90 günü aşmamak kaydıyla seyahatlerinde vizeden muaftır.",
            "en": "Ordinary and official passport holders are exempt from visa for their travels for a period not exceeding 90 days within 180 days.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind für ihre Reisen für einen Zeitraum von höchstens 90 Tagen innerhalb von 180 Tagen von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri 180 gün içinde 90 günü aşmamak kaydıyla seyahatlerinde vizeden muaftır.",
            "en": "Ordinary and official passport holders are exempt from visa for their travels for a period not exceeding 90 days within 180 days.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind für ihre Reisen für einen Zeitraum von höchstens 90 Tagen innerhalb von 180 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/kg.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Lao People's Democratic Republic",
        "iso2": "la",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus ve diğer resmi pasaport hamilleri vizeye tabidir.",
            "en": "Ordinary and other official passport holders are subject to a visa.",
            "de": "Inhaber eines gewöhnlichen und anderen offiziellen Reisepasses sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Diplomatic passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines Diplomatenpasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/la.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Latvia",
        "iso2": "lv",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri Türkiye’de son 180 gün içerisinde toplam kalış (ikamet) süresi 90 günü geçmemek kaydıyla turistik amaçlı seyahatlerinde vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for their touristic travels, provided that the total stay (residence) in Turkey in the last 180 days does not exceed 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für ihre touristischen Reisen von der Visumpflicht befreit, sofern der Gesamtaufenthalt (Aufenthalt) in der Türkei in den letzten 180 Tagen 90 Tage nicht überschreitet."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri Türkiye’de son 180 gün içerisinde toplam kalış (ikamet) süresi 90 günü geçmemek kaydıyla turistik amaçlı seyahatlerinde vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for their touristic travels, provided that the total stay (residence) in Turkey in the last 180 days does not exceed 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für ihre touristischen Reisen von der Visumpflicht befreit, sofern der Gesamtaufenthalt (Aufenthalt) in der Türkei in den letzten 180 Tagen 90 Tage nicht überschreitet."
        },
        "flag": "https:\/\/flagcdn.com\/lv.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Lebanon",
        "iso2": "lb",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Diplomatik, resmi ve umuma mahsus pasaport hamilleri, Türkiye’ye yapacakları turizm amaçlı seyahatleri veya transit geçişlerinde, Türkiye’de toplam ikamet süresi, ilk giriş tarihinden itibaren geçerli olacak şekilde, altı ay içerisinde 90 günü geçmemek kaydıyla vizeden muaftır.",
            "en": "Diplomatic, official and ordinary passport holders are exempt from visa for their tourism travels or transit passes to Turkey, provided that the total residence period in Turkey does not exceed 90 days within six months, valid from the date of first entry.",
            "de": "Diplomaten-, Beamten- und gewöhnliche Reisepassinhaber sind für ihre touristischen Reisen oder Transitpässe in die Türkei von der Visumpflicht befreit, sofern die Gesamtaufenthaltsdauer in der Türkei 90 Tage innerhalb von sechs Monaten, gültig ab dem Datum der ersten Einreise, nicht überschreitet."
        },
        "durations": {
            "tr": "Diplomatik, resmi ve umuma mahsus pasaport hamilleri, Türkiye’ye yapacakları turizm amaçlı seyahatleri veya transit geçişlerinde, Türkiye’de toplam ikamet süresi, ilk giriş tarihinden itibaren geçerli olacak şekilde, altı ay içerisinde 90 günü geçmemek kaydıyla vizeden muaftır.",
            "en": "Diplomatic, official and ordinary passport holders are exempt from visa for their tourism travels or transit passes to Turkey, provided that the total residence period in Turkey does not exceed 90 days within six months, valid from the date of first entry.",
            "de": "Diplomaten-, Beamten- und gewöhnliche Reisepassinhaber sind für ihre touristischen Reisen oder Transitpässe in die Türkei von der Visumpflicht befreit, sofern die Gesamtaufenthaltsdauer in der Türkei 90 Tage innerhalb von sechs Monaten, gültig ab dem Datum der ersten Einreise, nicht überschreitet."
        },
        "flag": "https:\/\/flagcdn.com\/lb.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Lesotho",
        "iso2": "ls",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaportlar vizeye tabidir.",
            "en": "Official and ordinary passports are subject to visa.",
            "de": "Amtliche und gewöhnliche Reisepässe unterliegen der Visumpflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/ls.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Liberia",
        "iso2": "lr",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaportlar vizeye tabidir.",
            "en": "Official and ordinary passports are subject to visa.",
            "de": "Amtliche und gewöhnliche Reisepässe unterliegen der Visumpflicht."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Diplomatic passport holders are exempt from visa for 90 days.",
            "de": "Inhaber eines Diplomatenpasses sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/lr.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Libya",
        "iso2": "ly",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "16 yaşından küçük ve 45 yaşından büyük umuma mahsus pasaport hamili Libya vatandaşları her 180 gün içinde 90 güne kadar turistik amaçlı seyahatlerinde vizeden muaftır. 16-45 yaş arasındaki umuma mahsus pasaport hamilleri ise vizeye tabidir. Bu yaş aralığındaki umuma mahsus pasaport hamili Libya vatandaşları Schengen ülkeleri veya ABD, İngiltere, İrlanda geçerli vizesi veya geçerli ikamet izni sahibi olmak ve belirli şartları taşımak koşuluyla 30 gün süreli e-Vizelerini www.evisa.gov.tr internet adresinden alabilmektedirler.",
            "en": "Libyan citizens who are under the age of 16 and over the age of 45 with ordinary passports are exempt from visa for their touristic travels for up to 90 days in every 180 days. Ordinary passport holders between the ages of 16 and 45 are subject to a visa. Libyan citizens with ordinary passports in this age range can obtain their 30-day e-Visa from the website www.evisa.gov.tr, provided that they have a valid visa or valid residence permit from the Schengen countries or the USA, UK, Ireland and meet certain conditions.",
            "de": "Libysche Staatsbürger unter 16 Jahren und über 45 Jahren mit gewöhnlichen Pässen sind für ihre touristischen Reisen für bis zu 90 Tage alle 180 Tage von der Visumpflicht befreit. Normale Passinhaber im Alter zwischen 16 und 45 Jahren sind visumpflichtig. Libysche Staatsbürger mit gewöhnlichen Reisepässen dieser Altersgruppe können ihr 30-Tage-E-Visum auf der Website www.evisa.gov.tr ​​erhalten, sofern sie über ein gültiges Visum oder eine gültige Aufenthaltserlaubnis aus den Schengen-Staaten oder den USA, dem Vereinigten Königreich und Irland verfügen und bestimmte Bedingungen erfüllen."
        },
        "durations": {
            "tr": "Resmî pasaport hamilleri her 6 ay içinde 90 güne kadar vizeden muaftır. 16 yaşından küçük ve 45 yaşından büyük umuma mahsus pasaport hamili Libya vatandaşları her 180 gün içinde 90 güne kadar turistik amaçlı seyahatlerinde vizeden muaftır. Bu yaş aralığındaki umuma mahsus pasaport hamili Libya vatandaşları Schengen ülkeleri veya ABD, İngiltere, İrlanda geçerli vizesi veya geçerli ikamet izni sahibi olmak ve belirli şartları taşımak koşuluyla 30 gün süreli e-Vizelerini www.evisa.gov.tr internet adresinden alabilmektedirler.",
            "en": "Official passport holders are exempt from visa for up to 90 days in every 6 months. Libyan citizens who are under the age of 16 and over the age of 45 with ordinary passports are exempt from visa for their touristic travels for up to 90 days in every 180 days. Libyan citizens with ordinary passports in this age range can obtain their 30-day e-Visa from the website www.evisa.gov.tr, provided that they have a valid visa or valid residence permit from the Schengen countries or the USA, UK, Ireland and meet certain conditions.",
            "de": "Inhaber eines offiziellen Reisepasses sind alle 6 Monate für bis zu 90 Tage von der Visumpflicht befreit. Libysche Staatsbürger unter 16 Jahren und über 45 Jahren mit gewöhnlichen Pässen sind für ihre touristischen Reisen für bis zu 90 Tage alle 180 Tage von der Visumpflicht befreit. Libysche Staatsbürger mit gewöhnlichen Reisepässen dieser Altersgruppe können ihr 30-Tage-E-Visum auf der Website www.evisa.gov.tr ​​erhalten, sofern sie über ein gültiges Visum oder eine gültige Aufenthaltserlaubnis aus den Schengen-Staaten oder den USA, dem Vereinigten Königreich und Irland verfügen und bestimmte Bedingungen erfüllen."
        },
        "flag": "https:\/\/flagcdn.com\/ly.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Liechtenstein",
        "iso2": "li",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/li.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Lithuania",
        "iso2": "lt",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/lt.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Luxembourg",
        "iso2": "lu",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/lu.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Macao SAR",
        "iso2": "mo",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Bu ülke için kaynak açıklaması bulunamadı.",
            "en": "No resource description found for this country.",
            "de": "Für dieses Land wurde keine Ressourcenbeschreibung gefunden."
        },
        "durations": {
            "tr": "Makau Özel İdare Bölgesi - Makau Special Administrative Region of the People’s Republic of China pasaportu hamilleri 30 güne kadar ikamet süreli seyahatlerinde vizeden muaftır.",
            "en": "Macau Special Administrative Region of the People's Republic of China passport holders are exempt from visa for their travels with a residence period of up to 30 days.",
            "de": "Inhaber eines Reisepasses der Sonderverwaltungsregion Macau der Volksrepublik China sind für Reisen mit einer Aufenthaltsdauer von bis zu 30 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/mo.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Madagascar",
        "iso2": "mg",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaportlar vizeye tabidir.",
            "en": "Official and ordinary passports are subject to visa.",
            "de": "Amtliche und gewöhnliche Reisepässe unterliegen der Visumpflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/mg.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Malawi",
        "iso2": "mw",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaportlar vizeye tabidir.",
            "en": "Official and ordinary passports are subject to visa.",
            "de": "Amtliche und gewöhnliche Reisepässe unterliegen der Visumpflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/mw.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Malaysia",
        "iso2": "my",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/my.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Maldives",
        "iso2": "mv",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri ise vizeye tabidir ve 90 gün ikamet süreli müteaddit giriş vizelerini www.evisa.gov.tr internet adresinden e-Vize olarak veya dış temsilciliklerimizden resen alabilirler.",
            "en": "Ordinary passport holders are subject to a visa and can obtain multiple entry visas with a 90-day residence period as an e-Visa from the website www.evisa.gov.tr ​​or ex officio from our foreign representative offices.",
            "de": "Inhaber eines gewöhnlichen Reisepasses sind visumpflichtig und können Mehrfacheinreisevisa mit einer Aufenthaltsdauer von 90 Tagen als E-Visum auf der Website www.evisa.gov.tr ​​​​oder von Amts wegen bei unseren Auslandsvertretungen erhalten."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 30 gün süreyle vizeden muaftır. Umuma mahsus pasaport hamilleri ise vizeye tabidir ve 90 gün ikamet süreli müteaddit giriş vizelerini www.evisa.gov.tr internet adresinden e-Vize olarak veya dış temsilciliklerimizden resen alabilirler.",
            "en": "Official passport holders are exempt from visa for 30 days. Ordinary passport holders are subject to a visa and can obtain multiple entry visas with a 90-day residence period as an e-Visa from the website www.evisa.gov.tr ​​or ex officio from our foreign representative offices.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 30 Tage von der Visumpflicht befreit. Inhaber eines gewöhnlichen Reisepasses sind visumpflichtig und können Mehrfacheinreisevisa mit einer Aufenthaltsdauer von 90 Tagen als E-Visum auf der Website www.evisa.gov.tr ​​​​oder von Amts wegen bei unseren Auslandsvertretungen erhalten."
        },
        "flag": "https:\/\/flagcdn.com\/mv.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Mali",
        "iso2": "ml",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi\/hizmet ve umuma mahsus pasaport hamili Mali vatandaşları ise vizeye tabidir.",
            "en": "Malian citizens holding official\/service and ordinary passports are subject to a visa.",
            "de": "Malische Staatsangehörige, die einen offiziellen\/dienstlichen oder gewöhnlichen Reisepass besitzen, sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamili Mali vatandaşları 90 güne kadar ikamet süreli seyahatlerinde vizeden muaftır.",
            "en": "Malian citizens holding diplomatic passports are exempt from visa for their travels with a residence period of up to 90 days.",
            "de": "Malische Staatsbürger, die einen Diplomatenpass besitzen, sind für Reisen mit einer Aufenthaltsdauer von bis zu 90 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ml.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Malta",
        "iso2": "mt",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary and official passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary and official passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/mt.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Marshall Islands",
        "iso2": "mh",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Official and ordinary passport holders are subject to a visa.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/mh.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Mauritania",
        "iso2": "mr",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri vizeye tabi olup, giriş vizeleri dış temsilciliklerimizce en fazla 15 gün, transit vizeleri ise en fazla 7 gün süreli verilir.",
            "en": "Ordinary passport holders are subject to a visa, entry visas are issued by our foreign representative offices for a maximum of 15 days, and transit visas are issued for a maximum of 7 days.",
            "de": "Inhaber eines gewöhnlichen Reisepasses sind visumpflichtig, Einreisevisa werden von unseren Auslandsvertretungen für maximal 15 Tage und Transitvisa für maximal 7 Tage ausgestellt."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 90 gün ikametli seyahatlerinde vizeden muaftır. Umuma mahsus pasaport hamilleri vizeye tabi olup, giriş vizeleri dış temsilciliklerimizce en fazla 15 gün, transit vizeleri ise en fazla 7 gün süreli verilir.",
            "en": "Official passport holders are exempt from visa for their travels with residence for 90 days. Ordinary passport holders are subject to a visa, entry visas are issued by our foreign representative offices for a maximum of 15 days, and transit visas are issued for a maximum of 7 days.",
            "de": "Inhaber eines offiziellen Reisepasses sind für ihre Reisen mit einem Aufenthalt von 90 Tagen von der Visumpflicht befreit. Inhaber eines gewöhnlichen Reisepasses sind visumpflichtig, Einreisevisa werden von unseren Auslandsvertretungen für maximal 15 Tage und Transitvisa für maximal 7 Tage ausgestellt."
        },
        "flag": "https:\/\/flagcdn.com\/mr.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Mauritius",
        "iso2": "mu",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamillerine 30 gün ikamet süreli müteaddit giriş vizeleri www.evisa.gov.tr internet adresinden e-Vize olarak veya dış temsilciliklerimizce verilir.",
            "en": "Regular entry visas for ordinary passport holders with a residence period of 30 days are issued as e-Visas on the website www.evisa.gov.tr ​​or by our foreign representative offices.",
            "de": "Reguläre Einreisevisa für Inhaber eines gewöhnlichen Reisepasses mit einer Aufenthaltsdauer von 30 Tagen werden als E-Visa auf der Website www.evisa.gov.tr ​​oder von unseren Auslandsvertretungen ausgestellt."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 90 gün süreyle vizeden muaftır. Umuma mahsus pasaport hamillerine 30 gün ikamet süreli müteaddit giriş vizeleri www.evisa.gov.tr internet adresinden e-Vize olarak veya dış temsilciliklerimizce verilir. Ayrıca, 90 gün ikamet süreli müteaddit giriş vizeleri dış temsilciliklerimizce resen verilir.",
            "en": "Official passport holders are exempt from visa for 90 days. Regular entry visas for ordinary passport holders with a residence period of 30 days are issued as e-Visas on the website www.evisa.gov.tr ​​or by our foreign representative offices. In addition, multiple entry visas with a residence period of 90 days are issued ex officio by our foreign representative offices.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 90 Tage von der Visumpflicht befreit. Reguläre Einreisevisa für Inhaber eines gewöhnlichen Reisepasses mit einer Aufenthaltsdauer von 30 Tagen werden als E-Visa auf der Website www.evisa.gov.tr ​​oder von unseren Auslandsvertretungen ausgestellt. Darüber hinaus werden von unseren Auslandsvertretungen von Amts wegen Mehrfachvisa mit einer Aufenthaltsdauer von 90 Tagen ausgestellt."
        },
        "flag": "https:\/\/flagcdn.com\/mu.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Mexico",
        "iso2": "mx",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Hizmet\/resmi ve umuma mahsus pasaport hamilleri ise vizeye tabi olup, 90 gün ikamet süreli müteaddit giriş vizelerini dış temsilciliklerimizden resen alabilirler.",
            "en": "Service\/official and ordinary passport holders are subject to a visa and can obtain multiple entry visas with a 90-day residence period ex officio from our foreign representative offices.",
            "de": "Dienst-\/Beamten- und gewöhnliche Reisepassinhaber sind visumpflichtig und können von Amts wegen bei unseren Auslandsvertretungen Visa für die mehrfache Einreise mit einer Aufenthaltsdauer von 90 Tagen erhalten."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamilleri 90 güne kadar ikamet süreli turistik veya resmi amaçlı seyahatlerinde ve transit geçişlerinde vizeden muaftır. Hizmet\/resmi ve umuma mahsus pasaport hamilleri ise vizeye tabi olup, 90 gün ikamet süreli müteaddit giriş vizelerini dış temsilciliklerimizden resen alabilirler. Ayrıca, 30 güne kadar ikamet süreli tek girişli e-Vizelerini www.evisa.gov.tr internet adresinden harçsız olarak alabilirler.",
            "en": "Diplomatic passport holders are exempt from visa for touristic or official travels and transits with a residence period of up to 90 days. Service\/official and ordinary passport holders are subject to a visa and can obtain multiple entry visas with a 90-day residence period ex officio from our foreign representative offices. Additionally, they can obtain their single-entry e-Visas for a residence period of up to 30 days, free of charge, from the website www.evisa.gov.tr.",
            "de": "Inhaber eines Diplomatenpasses sind für touristische oder dienstliche Reisen und Transitreisen mit einer Aufenthaltsdauer von bis zu 90 Tagen von der Visumpflicht befreit. Dienst-\/Beamten- und gewöhnliche Reisepassinhaber sind visumpflichtig und können von Amts wegen bei unseren Auslandsvertretungen Visa für die mehrfache Einreise mit einer Aufenthaltsdauer von 90 Tagen erhalten. Darüber hinaus können sie auf der Website www.evisa.gov.tr ​​ihr E-Visum für die einmalige Einreise mit einer Aufenthaltsdauer von bis zu 30 Tagen kostenlos erhalten."
        },
        "flag": "https:\/\/flagcdn.com\/mx.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Moldova, Republic of",
        "iso2": "md",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır. Toplam kalış süresi 180 gün içerisinde 90 günü geçemez.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days. The total duration of stay cannot exceed 90 days within 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit. Die Gesamtaufenthaltsdauer darf 90 Tage innerhalb von 180 Tagen nicht überschreiten."
        },
        "flag": "https:\/\/flagcdn.com\/md.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Monaco",
        "iso2": "mc",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/mc.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Mongolia",
        "iso2": "mn",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 30 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 30 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 30 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 30 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 30 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 30 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/mn.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Montenegro",
        "iso2": "me",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün ikametli seyahatlerinde vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for their 90-day residential travels.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für ihre 90-tägigen Aufenthalte in Wohngebieten von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün ikametli seyahatlerinde vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for their 90-day residential travels.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für ihre 90-tägigen Aufenthalte in Wohngebieten von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/me.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Morocco",
        "iso2": "ma",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ma.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Mozambique",
        "iso2": "mz",
        "visa_type": "consular",
        "descriptions": {
            "tr": ": Umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": ": Ordinary passport holders are subject to visa.",
            "de": ": Inhaber eines normalen Reisepasses sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik ve hizmet pasaportu hamilleri asgari 6 ay geçerli pasaport ile ilk giriş tarihinden itibaren her 180 gün içinde 90 günü aşmamak kaydıyla vizeden muaftır. Diplomatik ve hizmet pasaportu hamilleri asgari 6 ay geçerli pasaport ile ilk giriş tarihinden itibaren her 180 gün içinde 90 günü aşmamak kaydıyla vizeden muaftır.",
            "en": "Diplomatic and service passport holders with a passport valid for at least 6 months are exempt from visa for a period not exceeding 90 days within every 180 days from the date of first entry. Diplomatic and service passport holders with a passport valid for at least 6 months are exempt from visa for a period not exceeding 90 days within every 180 days from the date of first entry.",
            "de": "Inhaber von Diplomaten- und Dienstpässen mit einem noch mindestens 6 Monate gültigen Reisepass sind für einen Zeitraum von höchstens 90 Tagen innerhalb von 180 Tagen ab dem Datum der ersten Einreise von der Visumpflicht befreit. Inhaber von Diplomaten- und Dienstpässen mit einem noch mindestens 6 Monate gültigen Reisepass sind für einen Zeitraum von höchstens 90 Tagen innerhalb von 180 Tagen ab dem Datum der ersten Einreise von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/mz.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Myanmar",
        "iso2": "mm",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri de vizeye tabidir, istizan gerekir.",
            "en": "Ordinary passport holders are also subject to a visa, and permission is required.",
            "de": "Auch normale Reisepassinhaber unterliegen der Visumspflicht und benötigen eine Genehmigung."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri vizeye tabi olup, giriş vizeleri en fazla 30 gün, transit vizeleri ise en fazla 15 gün ikamet süreli verilir.",
            "en": "Official passport holders are subject to a visa, entry visas are issued for a maximum of 30 days, and transit visas are issued for a maximum of 15 days of residence.",
            "de": "Inhaber offizieller Reisepässe unterliegen der Visumspflicht, Einreisevisa werden für maximal 30 Tage und Transitvisa für maximal 15 Tage Aufenthalt ausgestellt."
        },
        "flag": "https:\/\/flagcdn.com\/mm.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Namibia",
        "iso2": "na",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri vizeye tabi olup, e- vizelerini 5 Mayıs 2025 tarihi itibariyle www.evisa.gov.tr internet adresinden alabilmektedirler.",
            "en": "Ordinary passport holders are subject to a visa and can obtain their e-visas from the website www.evisa.gov.tr ​​as of May 5, 2025.",
            "de": "Inhaber eines normalen Reisepasses sind visumpflichtig und können ab dem 5. Mai 2025 ihr E-Visum auf der Website www.evisa.gov.tr ​​​​erhalten."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official passport holders are exempt from visa for 90 days.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/na.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Nauru",
        "iso2": "nr",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir. Umuma mahsus pasaport hamillerine giriş vizeleri dış temsilciliklerimizce en fazla 15 gün, transit vizeleri en fazla 7 gün ikamet süreli verilir.",
            "en": "Official and ordinary passport holders are subject to a visa. Entry visas for ordinary passport holders are issued by our foreign representative offices for a maximum residence period of 15 days, and transit visas for a maximum residence period of 7 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht. Einreisevisa für normale Passinhaber werden von unseren Auslandsvertretungen für eine maximale Aufenthaltsdauer von 15 Tagen ausgestellt, Transitvisa für eine maximale Aufenthaltsdauer von 7 Tagen."
        },
        "durations": {
            "tr": "Umuma mahsus pasaport hamillerine giriş vizeleri dış temsilciliklerimizce en fazla 15 gün, transit vizeleri en fazla 7 gün ikamet süreli verilir.",
            "en": "Entry visas for ordinary passport holders are issued by our foreign representative offices for a maximum residence period of 15 days, and transit visas for a maximum residence period of 7 days.",
            "de": "Einreisevisa für normale Passinhaber werden von unseren Auslandsvertretungen für eine maximale Aufenthaltsdauer von 15 Tagen ausgestellt, Transitvisa für eine maximale Aufenthaltsdauer von 7 Tagen."
        },
        "flag": "https:\/\/flagcdn.com\/nr.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Nepal",
        "iso2": "np",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri de vizeye tabi olup istizan gerekir. Umuma mahsus pasaport hamillerine 15 güne kadar ikamet süreli giriş vizeleri dış temsilciliklerimizce istizansız, transit vizeleri ise en fazla 7 gün ikamet süreli verilir.",
            "en": "Ordinary passport holders are also subject to a visa and require permission. Entry visas for ordinary passport holders with a residence period of up to 15 days are issued by our foreign representative offices without exception, and transit visas with a residence period of up to 7 days are issued.",
            "de": "Auch normale Passinhaber sind visums- und genehmigungspflichtig. Einreisevisa für normale Passinhaber mit einer Aufenthaltsdauer von bis zu 15 Tagen werden ausnahmslos von unseren Auslandsvertretungen ausgestellt, Transitvisa mit einer Aufenthaltsdauer von bis zu 7 Tagen."
        },
        "durations": {
            "tr": "Resmi pasaport hamillerine giriş vizeleri en fazla 30 güne kadar ikamet süreli verilir. Umuma mahsus pasaport hamillerine 15 güne kadar ikamet süreli giriş vizeleri dış temsilciliklerimizce istizansız, transit vizeleri ise en fazla 7 gün ikamet süreli verilir. Schengen veya ABD, Birleşik Krallık, İrlanda geçerli vizesi veya geçerli ikamet izni hamillerine, belirli şartları taşımaları koşuluyla, 30 güne kadar ikamet süreli tek giriş vizesi, www.evisa.gov.tr internet adresinden e-Vize olarak ita edilmektedir.",
            "en": "Entry visas are issued to official passport holders for a maximum stay of up to 30 days. Entry visas for ordinary passport holders with a residence period of up to 15 days are issued by our foreign representative offices without exception, and transit visas with a residence period of up to 7 days are issued. A single entry visa with a residence period of up to 30 days is issued as an e-Visa on the website www.evisa.gov.tr ​​for holders of a valid Schengen visa or a valid residence permit from the USA, the UK or Ireland, provided that they meet certain conditions.",
            "de": "Einreisevisa werden Inhabern offizieller Reisepässe für einen maximalen Aufenthalt von bis zu 30 Tagen ausgestellt. Einreisevisa für normale Passinhaber mit einer Aufenthaltsdauer von bis zu 15 Tagen werden ausnahmslos von unseren Auslandsvertretungen ausgestellt, Transitvisa mit einer Aufenthaltsdauer von bis zu 7 Tagen. Ein einmaliges Einreisevisum mit einer Aufenthaltsdauer von bis zu 30 Tagen wird als E-Visum auf der Website www.evisa.gov.tr ​​für Inhaber eines gültigen Schengen-Visums oder einer gültigen Aufenthaltserlaubnis aus den USA, dem Vereinigten Königreich oder Irland ausgestellt, sofern sie bestimmte Voraussetzungen erfüllen."
        },
        "flag": "https:\/\/flagcdn.com\/np.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Netherlands",
        "iso2": "nl",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary and official passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary and official passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/nl.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "New Zealand",
        "iso2": "nz",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/nz.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Nicaragua",
        "iso2": "ni",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ni.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Niger",
        "iso2": "ne",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamili Nijer vatandaşları vizeye tabidir.",
            "en": "Niger citizens holding ordinary passports are subject to a visa.",
            "de": "Für nigerianische Staatsbürger, die einen gewöhnlichen Reisepass besitzen, ist ein Visum erforderlich."
        },
        "durations": {
            "tr": "Diplomatik ve hizmet pasaportu hamili Nijer vatandaşları her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Niger citizens holding diplomatic and service passports are exempt from visa for 90 days in every 180 days.",
            "de": "Niger-Bürger mit Diplomaten- und Dienstpässen sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ne.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Nigeria",
        "iso2": "ng",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi\/hizmet ve umuma mahsus pasaport hamili Nijerya vatandaşları vizeye tabidir.",
            "en": "Nigerian citizens holding official\/service and ordinary passports are subject to a visa.",
            "de": "Für nigerianische Staatsbürger, die einen offiziellen\/dienstlichen oder gewöhnlichen Reisepass besitzen, ist ein Visum erforderlich."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamili Nijerya vatandaşları ise 90 güne kadar ikamet süreli seyahatlerinde vizeden muaftır.",
            "en": "Nigerian citizens holding diplomatic passports are exempt from visa for their travels with a residence period of up to 90 days.",
            "de": "Nigerianische Staatsbürger mit Diplomatenpässen sind für Reisen mit einer Aufenthaltsdauer von bis zu 90 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ng.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "North Macedonia",
        "iso2": "mk",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Diplomatik, hizmet ve umuma mahsus pasaport hamili Kuzey Makedonya vatandaşları 90 güne kadar ikamet süreli seyahatlerinde vizeden muaftır.",
            "en": "North Macedonian citizens holding diplomatic, service and ordinary passports are exempt from visa for their travels with a residence period of up to 90 days.",
            "de": "Nordmazedonische Staatsbürger mit Diplomaten-, Dienst- und gewöhnlichen Reisepässen sind für Reisen mit einer Aufenthaltsdauer von bis zu 90 Tagen von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Diplomatik, hizmet ve umuma mahsus pasaport hamili Kuzey Makedonya vatandaşları 90 güne kadar ikamet süreli seyahatlerinde vizeden muaftır.",
            "en": "North Macedonian citizens holding diplomatic, service and ordinary passports are exempt from visa for their travels with a residence period of up to 90 days.",
            "de": "Nordmazedonische Staatsbürger mit Diplomaten-, Dienst- und gewöhnlichen Reisepässen sind für Reisen mit einer Aufenthaltsdauer von bis zu 90 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/mk.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Northern Mariana Islands",
        "iso2": "mp",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Official and ordinary passport holders are subject to a visa.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/mp.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Norway",
        "iso2": "no",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary and official passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır. Öte yandan, Norveç'ten ülkemize turistik amaçla seyahat edecek Norveç vatandaşları, 31 Aralık 2022 tarihine kadar pasaportları yerine çipli ulusal kimlik kartlarını kullanarak da her 180 günde 90 gün süreyle ülkemize vizesiz giriş yapabilirler.",
            "en": "Ordinary and official passport holders are exempt from visa for 90 days in every 180 days. On the other hand, Norwegian citizens who will travel from Norway to our country for touristic purposes can enter our country without a visa for 90 days in every 180 days, using their national identity cards with chips instead of their passports, until December 31, 2022.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit. Andererseits können norwegische Staatsbürger, die zu touristischen Zwecken aus Norwegen in unser Land reisen, bis zum 31. Dezember 2022 alle 180 Tage für 90 Tage ohne Visum in unser Land einreisen und dabei ihren Personalausweis mit Chip anstelle ihres Reisepasses verwenden."
        },
        "flag": "https:\/\/flagcdn.com\/no.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Oman",
        "iso2": "om",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri ülkemize yapacakları turistik amaçlı seyahatlerde her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days in every 180 days for their touristic trips to our country.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für ihre touristischen Reisen in unser Land alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri ülkemize yapacakları turistik amaçlı seyahatlerde her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days in every 180 days for their touristic trips to our country.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für ihre touristischen Reisen in unser Land alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/om.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Pakistan",
        "iso2": "pk",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri vizeye tabi olup istizan gerekir.",
            "en": "Ordinary passport holders are subject to a visa and are required to obtain permission.",
            "de": "Inhaber eines normalen Reisepasses sind visumpflichtig und müssen eine Genehmigung einholen."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 90 gün süreyle vizeden muaftır. Ayrıca, geçerli bir Schengen, İngiltere veya ABD vizesi hamilleri 30 gün ikamet süreli tek giriş vizelerini www.evisa.gov.tr internet adresinden e-Vize olarak alabilirler.",
            "en": "Official passport holders are exempt from visa for 90 days. In addition, holders of a valid Schengen, UK or USA visa can obtain their 30-day single entry visa as an e-Visa from the website www.evisa.gov.tr.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 90 Tage von der Visumpflicht befreit. Darüber hinaus können Inhaber eines gültigen Schengen-, UK- oder USA-Visums ihr 30-Tage-Visum für die einmalige Einreise als E-Visum auf der Website www.evisa.gov.tr ​​erhalten."
        },
        "flag": "https:\/\/flagcdn.com\/pk.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Palau",
        "iso2": "pw",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabi olup, giriş vizeleri dış temsilciliklerimizce en fazla 30 gün ikamet süreli verilir.",
            "en": "Official and ordinary passport holders are subject to a visa, and entry visas are issued by our foreign representative offices for a maximum residence period of 30 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumpflicht, Einreisevisa werden von unseren Auslandsvertretungen für eine maximale Aufenthaltsdauer von 30 Tagen ausgestellt."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabi olup, giriş vizeleri dış temsilciliklerimizce en fazla 30 gün ikamet süreli verilir.",
            "en": "Official and ordinary passport holders are subject to a visa, and entry visas are issued by our foreign representative offices for a maximum residence period of 30 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumpflicht, Einreisevisa werden von unseren Auslandsvertretungen für eine maximale Aufenthaltsdauer von 30 Tagen ausgestellt."
        },
        "flag": "https:\/\/flagcdn.com\/pw.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Panama",
        "iso2": "pa",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır. Toplam kalış süresi son 180 gün içerisinde 90 günü geçmez.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days. The total length of stay does not exceed 90 days in the last 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit. Die Gesamtaufenthaltsdauer darf in den letzten 180 Tagen 90 Tage nicht überschreiten."
        },
        "flag": "https:\/\/flagcdn.com\/pa.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Papua New Guinea",
        "iso2": "pg",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir. Umuma mahsus pasaport hamillerine giriş vizeleri dış temsilciliklerimizce en fazla 15 gün ikamet süreli, transit vizeleri ise en fazla 7 gün ikamet süreli verilir.",
            "en": "Official and ordinary passport holders are subject to a visa. Entry visas for ordinary passport holders are issued by our foreign representative offices for a maximum residence period of 15 days, and transit visas are issued for a maximum residence period of 7 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht. Einreisevisa für normale Passinhaber werden von unseren Auslandsvertretungen für eine maximale Aufenthaltsdauer von 15 Tagen ausgestellt, Transitvisa für eine maximale Aufenthaltsdauer von 7 Tagen."
        },
        "durations": {
            "tr": "Umuma mahsus pasaport hamillerine giriş vizeleri dış temsilciliklerimizce en fazla 15 gün ikamet süreli, transit vizeleri ise en fazla 7 gün ikamet süreli verilir.",
            "en": "Entry visas for ordinary passport holders are issued by our foreign representative offices for a maximum residence period of 15 days, and transit visas are issued for a maximum residence period of 7 days.",
            "de": "Einreisevisa für normale Passinhaber werden von unseren Auslandsvertretungen für eine maximale Aufenthaltsdauer von 15 Tagen ausgestellt, Transitvisa für eine maximale Aufenthaltsdauer von 7 Tagen."
        },
        "flag": "https:\/\/flagcdn.com\/pg.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Paraguay",
        "iso2": "py",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/py.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Peru",
        "iso2": "pe",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır. Toplam kalış süresi son 180 gün içerisinde 90 günü geçmez.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days. The total length of stay does not exceed 90 days in the last 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit. Die Gesamtaufenthaltsdauer darf in den letzten 180 Tagen 90 Tage nicht überschreiten."
        },
        "flag": "https:\/\/flagcdn.com\/pe.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Philippines",
        "iso2": "ph",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri ise vizeye tabi olup, Schengen ülkeleri veya ABD, Birleşik Krallık, İrlanda geçerli vizesi veya geçerli ikamet izni hamillerine, belirli şartları taşımaları koşuluyla, 30 güne kadar ikamet süreli tek giriş vizesi www.evisa.gov.tr internet adresinden e-Vize olarak ita edilmektedir. FİLİSTİN: Umuma mahsus pasaport hamilleri vizeye tabidir. Umuma mahsus pasaport hamili Filistin vatandaşları Schengen ülkeleri veya ABD, Birleşik Krallık, İrlanda geçerli vizesi veya geçerli ikamet izni hamili olmak ve belirli şartları karşılamak şartıyla, 30 güne kadar ikamet süreli tek giriş vizelerini www.evisa.gov.tr internet adresinden e-Vize olarak alabilmektedirler.",
            "en": "Ordinary passport holders are subject to a visa, and a single entry visa with a residence period of up to 30 days is issued as an e-Visa on the website www.evisa.gov.tr ​​for holders of a valid visa or valid residence permit of the Schengen countries or the USA, the United Kingdom, Ireland, provided that they meet certain conditions. PALESTINE: Ordinary passport holders are subject to a visa. Palestinian citizens holding ordinary passports can obtain single entry visas with a residence period of up to 30 days as an e-Visa from the website www.evisa.gov.tr, provided that they have a valid visa or a valid residence permit from the Schengen countries or the USA, the United Kingdom, Ireland and meet certain conditions.",
            "de": "Inhaber eines gewöhnlichen Reisepasses sind visumpflichtig, und ein Visum für die einmalige Einreise mit einer Aufenthaltsdauer von bis zu 30 Tagen wird als E-Visum auf der Website www.evisa.gov.tr ​​​​für Inhaber eines gültigen Visums oder einer gültigen Aufenthaltserlaubnis der Schengen-Staaten oder der USA, des Vereinigten Königreichs und Irlands ausgestellt, sofern sie bestimmte Bedingungen erfüllen. PALÄSTINENS: Inhaber eines normalen Reisepasses sind visumpflichtig. Palästinensische Staatsbürger mit gewöhnlichen Pässen können auf der Website www.evisa.gov.tr ​​einmalige Einreisevisa mit einer Aufenthaltsdauer von bis zu 30 Tagen als E-Visum erhalten, sofern sie über ein gültiges Visum oder eine gültige Aufenthaltserlaubnis aus den Schengen-Staaten oder den USA, dem Vereinigten Königreich und Irland verfügen und bestimmte Bedingungen erfüllen."
        },
        "durations": {
            "tr": "Diplomatik ve resmi\/hizmet pasaportu hamili Filipinler vatandaşları 30 güne kadar ikamet süreli seyahatlerinde vizeden muaf bulunmaktadırlar. Umuma mahsus pasaport hamilleri ise vizeye tabi olup, Schengen ülkeleri veya ABD, Birleşik Krallık, İrlanda geçerli vizesi veya geçerli ikamet izni hamillerine, belirli şartları taşımaları koşuluyla, 30 güne kadar ikamet süreli tek giriş vizesi www.evisa.gov.tr internet adresinden e-Vize olarak ita edilmektedir. Umuma mahsus pasaport hamili Filistin vatandaşları Schengen ülkeleri veya ABD, Birleşik Krallık, İrlanda geçerli vizesi veya geçerli ikamet izni hamili olmak ve belirli şartları karşılamak şartıyla, 30 güne kadar ikamet süreli tek giriş vizelerini www.evisa.gov.tr internet adresinden e-Vize olarak alabilmektedirler. Diplomatik pasaport hamilleri resmi veya turistik amaçlı seyahatlerinde her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Philippine citizens holding diplomatic and official\/service passports are exempt from visa for their travels with a residence period of up to 30 days. Ordinary passport holders are subject to a visa, and a single entry visa with a residence period of up to 30 days is issued as an e-Visa on the website www.evisa.gov.tr ​​for holders of a valid visa or valid residence permit of the Schengen countries or the USA, the United Kingdom, Ireland, provided that they meet certain conditions. Palestinian citizens holding ordinary passports can obtain single entry visas with a residence period of up to 30 days as an e-Visa from the website www.evisa.gov.tr, provided that they have a valid visa or a valid residence permit from the Schengen countries or the USA, the United Kingdom, Ireland and meet certain conditions. Diplomatic passport holders are exempt from visa for 90 days in every 180 days for their official or touristic travels.",
            "de": "Philippinische Staatsbürger mit Diplomaten- und Dienstpässen sind für Reisen mit einer Aufenthaltsdauer von bis zu 30 Tagen von der Visumpflicht befreit. Inhaber eines gewöhnlichen Reisepasses sind visumpflichtig, und ein Visum für die einmalige Einreise mit einer Aufenthaltsdauer von bis zu 30 Tagen wird als E-Visum auf der Website www.evisa.gov.tr ​​​​für Inhaber eines gültigen Visums oder einer gültigen Aufenthaltserlaubnis der Schengen-Staaten oder der USA, des Vereinigten Königreichs und Irlands ausgestellt, sofern sie bestimmte Bedingungen erfüllen. Palästinensische Staatsbürger mit gewöhnlichen Pässen können auf der Website www.evisa.gov.tr ​​einmalige Einreisevisa mit einer Aufenthaltsdauer von bis zu 30 Tagen als E-Visum erhalten, sofern sie über ein gültiges Visum oder eine gültige Aufenthaltserlaubnis aus den Schengen-Staaten oder den USA, dem Vereinigten Königreich und Irland verfügen und bestimmte Bedingungen erfüllen. Inhaber eines Diplomatenpasses sind bei offiziellen oder touristischen Reisen alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ph.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Poland",
        "iso2": "pl",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/pl.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Portugal",
        "iso2": "pt",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary and official passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary and official passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/pt.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Qatar",
        "iso2": "qa",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/qa.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Republic of Cyprus",
        "iso2": "cy",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri de vizeye tabi olup, 30 gün ikamet süreli tek girişli vizelerini www.evisa.gov.tr internet adresinden e-Vize olarak veya dış temsilciliklerimizden alabilirler.",
            "en": "Ordinary passport holders are also subject to a visa, and they can obtain their single-entry visa with a 30-day residence period as an e-Visa from the website www.evisa.gov.tr ​​or from our foreign representative offices.",
            "de": "Auch normale Passinhaber unterliegen der Visumspflicht und können ihr Visum für die einmalige Einreise mit einer Aufenthaltsdauer von 30 Tagen als E-Visum auf der Website www.evisa.gov.tr ​​​​oder bei unseren Auslandsvertretungen erhalten."
        },
        "durations": {
            "tr": "Ayrıca 30 güne kadar ikamet süreli tek girişli e-Vizeyle bütün hudut kapılarımızdan ülkemize giriş yapabilmektedirler. Umuma mahsus pasaport hamilleri de vizeye tabi olup, 30 gün ikamet süreli tek girişli vizelerini www.evisa.gov.tr internet adresinden e-Vize olarak veya dış temsilciliklerimizden alabilirler.",
            "en": "Additionally, they can enter our country through all our border gates with a single-entry e-Visa with a residence period of up to 30 days. Ordinary passport holders are also subject to a visa, and they can obtain their single-entry visa with a 30-day residence period as an e-Visa from the website www.evisa.gov.tr ​​or from our foreign representative offices.",
            "de": "Darüber hinaus können sie mit einem einmaligen E-Visum mit einer Aufenthaltsdauer von bis zu 30 Tagen über alle unsere Grenztore in unser Land einreisen. Auch normale Passinhaber unterliegen der Visumspflicht und können ihr Visum für die einmalige Einreise mit einer Aufenthaltsdauer von 30 Tagen als E-Visum auf der Website www.evisa.gov.tr ​​​​oder bei unseren Auslandsvertretungen erhalten."
        },
        "flag": "https:\/\/flagcdn.com\/cy.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Republic of Korea",
        "iso2": "kr",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/kr.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Romania",
        "iso2": "ro",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır. Kimlik kartı hamili Romanya vatandaşları turistik ziyaretler için her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days in every 180 days. Romanian citizens with an ID card are exempt from visa for touristic visits for 90 days in every 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind alle 180 Tage für 90 Tage von der Visumpflicht befreit. Rumänische Staatsbürger mit einem Personalausweis sind alle 180 Tage für 90 Tage von der Visumpflicht für touristische Besuche befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ro.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Russian Federation",
        "iso2": "ru",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri 60 günü geçmeyen turistik ve iş görüşmesi amaçlı seyahatlerinde vizeden muaftır. Umuma mahsus pasaport hamilleri vizeye tabidir",
            "en": "Ordinary passport holders are exempt from visa for touristic and business travels that do not exceed 60 days. Ordinary passport holders are subject to a visa",
            "de": "Normale Passinhaber sind für Touristen- und Geschäftsreisen, die 60 Tage nicht überschreiten, von der Visumpflicht befreit. Inhaber eines normalen Reisepasses sind visumpflichtig"
        },
        "durations": {
            "tr": "Umuma mahsus pasaport hamilleri 60 günü geçmeyen turistik ve iş görüşmesi amaçlı seyahatlerinde vizeden muaftır. Hizmet pasaportu hamilleri her 180 günde 90 günü aşmamak şartıyla 30 günlük süreyle vizeden muaftır. Diplomatik pasaport hamilleri 90 gün süreyle vizeden muaftır. Nevis vatandaşları 90 güne kadar ikamet süreli seyahatlerinde vizeden muaftır.",
            "en": "Ordinary passport holders are exempt from visa for touristic and business travels that do not exceed 60 days. Service passport holders are exempt from visa for 30 days, provided that it does not exceed 90 days in every 180 days. Diplomatic passport holders are exempt from visa for 90 days. Nevis citizens are exempt from visa for their travels with a residence period of up to 90 days.",
            "de": "Normale Passinhaber sind für Touristen- und Geschäftsreisen, die 60 Tage nicht überschreiten, von der Visumpflicht befreit. Inhaber eines Dienstpasses sind für 30 Tage von der Visumpflicht befreit, sofern die Dauer von 180 Tagen 90 Tage nicht überschreitet. Inhaber eines Diplomatenpasses sind für 90 Tage von der Visumpflicht befreit. Nevis-Bürger sind für Reisen mit einer Aufenthaltsdauer von bis zu 90 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ru.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Rwanda",
        "iso2": "rw",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Ordinary passport holders are subject to a visa.",
            "de": "Inhaber eines normalen Reisepasses sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik ve hizmet pasaportu hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Diplomatic and service passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber von Diplomaten- und Dienstpässen sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/rw.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Saint Lucia",
        "iso2": "lc",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri vizeye tabidir ve 90 gün ikamet süreli müteaddit giriş vizelerini www.evisa.gov.tr internet adresinden e-Vize olarak veya dış temsilciliklerimizden alabilirler. Umuma mahsus pasaport hamillerine 90 gün ikamet süreli müteaddit giriş vizeleri www.evisa.gov.tr internet adresinden e-Vize şeklinde veya dış temsilciliklerimizde resen veya sınır kapılarımızda bandrol tatbiki suretiyle verilir.",
            "en": "Ordinary passport holders are subject to a visa and can obtain multiple entry visas with a 90-day residence period as an e-Visa from the website www.evisa.gov.tr ​​or from our foreign representative offices. Regular entry visas for ordinary passport holders with a residence period of 90 days are issued in the form of e-Visas on the website www.evisa.gov.tr ​​or ex officio at our foreign representative offices or by applying a banderol at our border gates.",
            "de": "Inhaber eines gewöhnlichen Reisepasses sind visumpflichtig und können auf der Website www.evisa.gov.tr ​​​​oder bei unseren Auslandsvertretungen ein Visum für die mehrfache Einreise mit einer Aufenthaltsdauer von 90 Tagen als E-Visum erhalten. Reguläre Einreisevisa für normale Passinhaber mit einer Aufenthaltsdauer von 90 Tagen werden in Form von E-Visa auf der Website www.evisa.gov.tr ​​​​oder von Amts wegen in unseren Auslandsvertretungen oder durch Anbringen einer Banderole an unseren Grenztoren ausgestellt."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 90 gün süreyle vizeden muaftır. Umuma mahsus pasaport hamilleri vizeye tabidir ve 90 gün ikamet süreli müteaddit giriş vizelerini www.evisa.gov.tr internet adresinden e-Vize olarak veya dış temsilciliklerimizden alabilirler. SAINT VINCENT ve GRENADINES: Resmi pasaport hamilleri 90 gün ikametli seyahatlerinde vizeden muaftır. Umuma mahsus pasaport hamillerine 90 gün ikamet süreli müteaddit giriş vizeleri www.evisa.gov.tr internet adresinden e-Vize şeklinde veya dış temsilciliklerimizde resen veya sınır kapılarımızda bandrol tatbiki suretiyle verilir.",
            "en": "Official passport holders are exempt from visa for 90 days. Ordinary passport holders are subject to a visa and can obtain multiple entry visas with a 90-day residence period as an e-Visa from the website www.evisa.gov.tr ​​or from our foreign representative offices. SAINT VINCENT and GRENADINES: Official passport holders are exempt from visa for their 90-day residential travels. Regular entry visas for ordinary passport holders with a residence period of 90 days are issued in the form of e-Visas on the website www.evisa.gov.tr ​​or ex officio at our foreign representative offices or by applying a banderol at our border gates.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 90 Tage von der Visumpflicht befreit. Inhaber eines gewöhnlichen Reisepasses sind visumpflichtig und können auf der Website www.evisa.gov.tr ​​​​oder bei unseren Auslandsvertretungen ein Visum für die mehrfache Einreise mit einer Aufenthaltsdauer von 90 Tagen als E-Visum erhalten. SAINT VINCENT und GRENADINEN: Inhaber eines offiziellen Reisepasses sind für ihre 90-tägigen Aufenthalte in Wohngebieten von der Visumpflicht befreit. Reguläre Einreisevisa für normale Passinhaber mit einer Aufenthaltsdauer von 90 Tagen werden in Form von E-Visa auf der Website www.evisa.gov.tr ​​​​oder von Amts wegen in unseren Auslandsvertretungen oder durch Anbringen einer Banderole an unseren Grenztoren ausgestellt."
        },
        "flag": "https:\/\/flagcdn.com\/lc.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Samoa",
        "iso2": "ws",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Official and ordinary passport holders are subject to a visa.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/ws.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "San Marino",
        "iso2": "sm",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır. SAO TOME ve PRINCIPE: Resmi ve umuma mahsus pasaportlar hamilleri vizeye tabidir.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days. SAO TOME and PRINCIPE: Official and ordinary passport holders are subject to a visa.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit. SAO TOME und PRINCIPE: Offizielle und gewöhnliche Reisepassinhaber unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/sm.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Saudi Arabia",
        "iso2": "sa",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri ülkemize yapacakları turistik amaçlı seyahatlerde her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days in every 180 days for their touristic trips to our country.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für ihre touristischen Reisen in unser Land alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri ülkemize yapacakları turistik amaçlı seyahatlerde her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days in every 180 days for their touristic trips to our country.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für ihre touristischen Reisen in unser Land alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/sa.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Senegal",
        "iso2": "sn",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Resmi\/hizmet ve umuma mahsus pasaport hamili Senegal vatandaşları ise vizeye tabidir.",
            "en": "Senegalese citizens holding official\/service and ordinary passports are subject to a visa.",
            "de": "Senegalesische Staatsbürger, die einen offiziellen\/dienstlichen und einen gewöhnlichen Reisepass besitzen, sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamili Senegal vatandaşları 90 güne kadar ikamet süreli seyahatlerinde vizeden muaftır. Schengen ülkeleri veya ABD, Birleşik Krallık, İrlanda geçerli vizesi veya geçerli ikamet izni hamillerine, belirli şartları taşımaları koşuluyla, 30 güne kadar ikamet süreli tek giriş vizesi www.evisa.gov.tr internet adresinden e-Vize olarak ita edilebilmektedir.",
            "en": "Senegalese citizens holding diplomatic passports are exempt from visa for their travels with a residence period of up to 90 days. A single entry visa with a residence period of up to 30 days can be applied for as an e-Visa on the website www.evisa.gov.tr ​​for holders of a valid visa or valid residence permit from Schengen countries or the USA, the United Kingdom, Ireland, provided that they meet certain conditions.",
            "de": "Senegalesische Staatsbürger, die einen Diplomatenpass besitzen, sind für Reisen mit einer Aufenthaltsdauer von bis zu 90 Tagen von der Visumpflicht befreit. Ein einmaliges Einreisevisum mit einer Aufenthaltsdauer von bis zu 30 Tagen kann als E-Visum auf der Website www.evisa.gov.tr ​​für Inhaber eines gültigen Visums oder einer gültigen Aufenthaltserlaubnis aus Schengen-Staaten oder den USA, dem Vereinigten Königreich, Irland beantragt werden, sofern sie bestimmte Voraussetzungen erfüllen."
        },
        "flag": "https:\/\/flagcdn.com\/sn.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Serbia",
        "iso2": "rs",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/rs.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Seychelles",
        "iso2": "sc",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Diplomatik, resmî ve umuma mahsus pasaport hamili Seyşeller vatandaşları her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Seychelles citizens holding diplomatic, official and ordinary passports are exempt from visa for 90 days in every 180 days.",
            "de": "Bürger der Seychellen, die einen Diplomaten-, Amts- oder gewöhnlichen Reisepass besitzen, sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Diplomatik, resmî ve umuma mahsus pasaport hamili Seyşeller vatandaşları her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Seychelles citizens holding diplomatic, official and ordinary passports are exempt from visa for 90 days in every 180 days.",
            "de": "Bürger der Seychellen, die einen Diplomaten-, Amts- oder gewöhnlichen Reisepass besitzen, sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/sc.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Sierra Leone",
        "iso2": "sl",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamili Sierra Leone vatandaşları vizeye tabidir.",
            "en": "Citizens of Sierra Leone who hold ordinary passports are subject to a visa.",
            "de": "Staatsbürger Sierra Leones, die einen gewöhnlichen Reisepass besitzen, sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik ve hizmet pasaportu hamili Sierra Leone vatandaşları her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Sierra Leonean citizens holding diplomatic and service passports are exempt from visa for 90 days in every 180 days.",
            "de": "Bürger von Sierra Leone, die einen Diplomaten- und Dienstpass besitzen, sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/sl.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Singapore",
        "iso2": "sg",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/sg.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Slovakia",
        "iso2": "sk",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri, Türkiye’de ikamet süresi her giriş için 90 günü geçmeyen seyahatlerinde vizeden muaftır.",
            "en": "Ordinary and official passport holders are exempt from visa for their travels whose residence period in Turkey does not exceed 90 days for each entry.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind für Reisen, deren Aufenthaltsdauer in der Türkei 90 Tage pro Einreise nicht überschreitet, von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri, Türkiye’de ikamet süresi her giriş için 90 günü geçmeyen seyahatlerinde vizeden muaftır. Toplam kalış süresi son 180 gün içerisinde 90 günü geçemez.",
            "en": "Ordinary and official passport holders are exempt from visa for their travels whose residence period in Turkey does not exceed 90 days for each entry. The total length of stay cannot exceed 90 days in the last 180 days.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind für Reisen, deren Aufenthaltsdauer in der Türkei 90 Tage pro Einreise nicht überschreitet, von der Visumpflicht befreit. Die Gesamtaufenthaltsdauer darf in den letzten 180 Tagen 90 Tage nicht überschreiten."
        },
        "flag": "https:\/\/flagcdn.com\/sk.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Slovenia",
        "iso2": "si",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/si.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Solomon Islands",
        "iso2": "sb",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir. Umuma mahsus pasaport hamillerine giriş vizeleri dış temsilciliklerimizce en fazla 15 gün, transit vizeleri en fazla 7 gün ikamet süreli verilir.",
            "en": "Official and ordinary passport holders are subject to a visa. Entry visas for ordinary passport holders are issued by our foreign representative offices for a maximum residence period of 15 days, and transit visas for a maximum residence period of 7 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht. Einreisevisa für normale Passinhaber werden von unseren Auslandsvertretungen für eine maximale Aufenthaltsdauer von 15 Tagen ausgestellt, Transitvisa für eine maximale Aufenthaltsdauer von 7 Tagen."
        },
        "durations": {
            "tr": "Umuma mahsus pasaport hamillerine giriş vizeleri dış temsilciliklerimizce en fazla 15 gün, transit vizeleri en fazla 7 gün ikamet süreli verilir.",
            "en": "Entry visas for ordinary passport holders are issued by our foreign representative offices for a maximum residence period of 15 days, and transit visas for a maximum residence period of 7 days.",
            "de": "Einreisevisa für normale Passinhaber werden von unseren Auslandsvertretungen für eine maximale Aufenthaltsdauer von 15 Tagen ausgestellt, Transitvisa für eine maximale Aufenthaltsdauer von 7 Tagen."
        },
        "flag": "https:\/\/flagcdn.com\/sb.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Somalia",
        "iso2": "so",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaportlar vizeye tabidir.",
            "en": "Official and ordinary passports are subject to visa.",
            "de": "Amtliche und gewöhnliche Reisepässe unterliegen der Visumpflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/so.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "South Africa",
        "iso2": "za",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma Mahsus Pasaport hamilleri vizeye tabidir. Umuma Mahsus Pasaport Hamilleri vizelerini e-Vize olarak www.evisa.gov.tr internet adresinden harçsız olarak alabilmektedir.",
            "en": "Ordinary passport holders are subject to a visa. Ordinary Passport Holders can obtain their visas as e-Visas, free of charge, from the website www.evisa.gov.tr.",
            "de": "Inhaber eines normalen Reisepasses sind visumpflichtig. Inhaber eines normalen Reisepasses können ihre Visa als E-Visa kostenlos auf der Website www.evisa.gov.tr ​​erhalten."
        },
        "durations": {
            "tr": "Resmi Pasaport hamilleri her 180 günde 90 günü aşmamak kaydıyla 30 gün süreyle vizeden muaftır.",
            "en": "Official Passport holders are exempt from visa for 30 days, not exceeding 90 days in every 180 days.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 30 Tage von der Visumpflicht befreit, höchstens jedoch für 90 Tage alle 180 Tage."
        },
        "flag": "https:\/\/flagcdn.com\/za.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "South Sudan",
        "iso2": "ss",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Hizmet ve umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Service and ordinary passport holders are subject to a visa.",
            "de": "Dienst- und gewöhnliche Reisepassinhaber unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/ss.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Spain",
        "iso2": "es",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary and official passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary and official passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/es.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Sri Lanka",
        "iso2": "lk",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Resmî ve umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Official and ordinary passport holders are subject to a visa.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/lk.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Sudan",
        "iso2": "sd",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Diğer resmi ve umuma mahsus pasaport hamilleri ise vizeye tabidir.",
            "en": "Other official and ordinary passport holders are subject to a visa.",
            "de": "Andere offizielle und gewöhnliche Reisepassinhaber unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamilleri, Türkiye’ye yapacakları turizm amaçlı seyahatleri veya transit geçişlerinde, 90 gün süreyle vizeden muaftır.",
            "en": "Diplomatic passport holders are exempt from visa for 90 days during their tourism travels or transit passes to Turkey.",
            "de": "Inhaber eines Diplomatenpasses sind während ihrer touristischen Reisen oder Transitpässe in die Türkei 90 Tage lang von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/sd.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Suriname",
        "iso2": "sr",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Diplomatik ve hizmet pasaportu hamilleriher 180 günde 90 gün süreyle vizeden muaftır.Umuma mahsus pasaport hamilleri vizeye tabi olup, 30 güne kadar ikamet süreli tek giriş vizelerini www.evisa.gov.tr internet adresinden e-vize olarak alabilmektedirler.",
            "en": "Diplomatic and service passport holders are exempt from visa for 90 days in every 180 days. Ordinary passport holders are subject to a visa and can obtain single entry visas with a residence period of up to 30 days as an e-visa from the website www.evisa.gov.tr.",
            "de": "Inhaber von Diplomaten- und Dienstpässen sind alle 180 Tage für 90 Tage von der Visumpflicht befreit. Inhaber eines gewöhnlichen Reisepasses sind visumpflichtig und können auf der Website www.evisa.gov.tr ​​ein einmaliges Einreisevisum mit einer Aufenthaltsdauer von bis zu 30 Tagen als E-Visum erhalten."
        },
        "durations": {
            "tr": "Diplomatik ve hizmet pasaportu hamilleriher 180 günde 90 gün süreyle vizeden muaftır.Umuma mahsus pasaport hamilleri vizeye tabi olup, 30 güne kadar ikamet süreli tek giriş vizelerini www.evisa.gov.tr internet adresinden e-vize olarak alabilmektedirler.",
            "en": "Diplomatic and service passport holders are exempt from visa for 90 days in every 180 days. Ordinary passport holders are subject to a visa and can obtain single entry visas with a residence period of up to 30 days as an e-visa from the website www.evisa.gov.tr.",
            "de": "Inhaber von Diplomaten- und Dienstpässen sind alle 180 Tage für 90 Tage von der Visumpflicht befreit. Inhaber eines gewöhnlichen Reisepasses sind visumpflichtig und können auf der Website www.evisa.gov.tr ​​ein einmaliges Einreisevisum mit einer Aufenthaltsdauer von bis zu 30 Tagen als E-Visum erhalten."
        },
        "flag": "https:\/\/flagcdn.com\/sr.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Sweden",
        "iso2": "se",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/se.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Switzerland",
        "iso2": "ch",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ch.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Syrian Arab Republic",
        "iso2": "sy",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabi olup istizan gerekir.",
            "en": "Official and ordinary passport holders are subject to a visa and permission is required.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visum- und Genehmigungspflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/sy.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Taiwan, Province of China",
        "iso2": "tw",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir. Umuma mahsus pasaport hamillerine, belirli şartları taşımaları koşuluyla, 30 güne kadar ikamet süreli tek giriş vizesi www.evisa.gov.tr internet adresinden e-Vize olarak ita edilmektedir.",
            "en": "Official and ordinary passport holders are subject to a visa. A single entry visa with a residence period of up to 30 days is issued as an e-Visa to ordinary passport holders, provided that they meet certain conditions, from the website www.evisa.gov.tr.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht. Ein einmaliges Einreisevisum mit einer Aufenthaltsdauer von bis zu 30 Tagen wird als E-Visum für gewöhnliche Passinhaber auf der Website www.evisa.gov.tr ​​ausgestellt, sofern sie bestimmte Bedingungen erfüllen."
        },
        "durations": {
            "tr": "Umuma mahsus pasaport hamillerine, belirli şartları taşımaları koşuluyla, 30 güne kadar ikamet süreli tek giriş vizesi www.evisa.gov.tr internet adresinden e-Vize olarak ita edilmektedir.",
            "en": "A single entry visa with a residence period of up to 30 days is issued as an e-Visa to ordinary passport holders, provided that they meet certain conditions, from the website www.evisa.gov.tr.",
            "de": "Ein einmaliges Einreisevisum mit einer Aufenthaltsdauer von bis zu 30 Tagen wird als E-Visum für gewöhnliche Passinhaber auf der Website www.evisa.gov.tr ​​ausgestellt, sofern sie bestimmte Bedingungen erfüllen."
        },
        "flag": "https:\/\/flagcdn.com\/tw.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Tajikistan",
        "iso2": "tj",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Ordinary passport holders are subject to a visa.",
            "de": "Inhaber eines normalen Reisepasses sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamilleri her 180 gün içinde 90 güne kadar vizeden muaftır. Hizmet pasaportu hamilleri her 180 gün içerisinde 60 güne kadar vizeden muaftır.",
            "en": "Diplomatic passport holders are exempt from visa for up to 90 days in every 180 days. Service passport holders are exempt from visa for up to 60 days in every 180 days.",
            "de": "Inhaber eines Diplomatenpasses sind alle 180 Tage für bis zu 90 Tage von der Visumpflicht befreit. Inhaber eines Dienstpasses sind alle 180 Tage für bis zu 60 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/tj.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Tanzania, United Republic of",
        "iso2": "tz",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamili Tanzanya vatandaşları ise vizeye tabidir.",
            "en": "Tanzanian citizens holding ordinary passports are subject to a visa.",
            "de": "Tansanische Staatsbürger, die einen gewöhnlichen Reisepass besitzen, sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik ve hizmet pasaportu hamili Tanzanya vatandaşları 90 güne kadar ikamet süreli seyahatlerinde vizeden muaftır.",
            "en": "Tanzanian citizens holding diplomatic and service passports are exempt from visa for their travels with a residence period of up to 90 days.",
            "de": "Tansanische Staatsbürger mit Diplomaten- und Dienstpässen sind für Reisen mit einer Aufenthaltsdauer von bis zu 90 Tagen von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/tz.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Thailand",
        "iso2": "th",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri ise 30 gün süreyle vizeden muaftır.",
            "en": "Ordinary passport holders are exempt from visa for 30 days.",
            "de": "Normale Passinhaber sind 30 Tage lang von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 90 gün süreyle vizeden muaftır. Umuma mahsus pasaport hamilleri ise 30 gün süreyle vizeden muaftır.",
            "en": "Official passport holders are exempt from visa for 90 days. Ordinary passport holders are exempt from visa for 30 days.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 90 Tage von der Visumpflicht befreit. Normale Passinhaber sind 30 Tage lang von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/th.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Timor-Leste",
        "iso2": "tl",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Official and ordinary passport holders are subject to a visa.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Doğu Timor vatandaşları 30 gün ikamet süreli tek giriş e-Vizelerini www.evisa.gov.tr internet adresinden alabilirler.",
            "en": "East Timor citizens can obtain their single entry e-Visa for 30 days from the website www.evisa.gov.tr.",
            "de": "Bürger Osttimors können ihr E-Visum für die einmalige Einreise für 30 Tage auf der Website www.evisa.gov.tr ​​erhalten."
        },
        "flag": "https:\/\/flagcdn.com\/tl.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Togo",
        "iso2": "tg",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus ve diğer resmi pasaport hamilleri vizeye tabidir.",
            "en": "Ordinary and other official passport holders are subject to a visa.",
            "de": "Inhaber eines gewöhnlichen und anderen offiziellen Reisepasses sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Diplomatic passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber eines Diplomatenpasses sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/tg.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Tonga",
        "iso2": "to",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Official and ordinary passport holders are subject to a visa.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/to.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Trinidad and Tobago",
        "iso2": "tt",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/tt.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Tunisia",
        "iso2": "tn",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/tn.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Turkish Republic of Northern Cyprus",
        "iso2": "nc",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/upload.wikimedia.org\/wikipedia\/commons\/e\/ef\/Flag_of_the_Turkish_Republic_of_Northern_Cyprus.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Turkmenistan",
        "iso2": "tm",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Ordinary passport holders are subject to a visa.",
            "de": "Inhaber eines normalen Reisepasses sind visumpflichtig."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 30 gün süreyle vizeden muaftır.",
            "en": "Official passport holders are exempt from visa for 30 days.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 30 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/tm.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Tuvalu",
        "iso2": "tv",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Official and ordinary passport holders are subject to a visa.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/tv.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Uganda",
        "iso2": "ug",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaportlar vizeye tabidir.",
            "en": "Official and ordinary passports are subject to visa.",
            "de": "Amtliche und gewöhnliche Reisepässe unterliegen der Visumpflicht."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Diplomatic passport holders are exempt from visa for 90 days.",
            "de": "Inhaber eines Diplomatenpasses sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ug.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Ukraine",
        "iso2": "ua",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days in every 180 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ua.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "United Arab Emirates",
        "iso2": "ae",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamili Birleşik Arap Emirlikleri vatandaşları ülkemize yapacakları turistik amaçlı seyahatlerde her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Citizens of the United Arab Emirates who hold ordinary passports are exempt from visa for 90 days in every 180 days for their touristic trips to our country.",
            "de": "Bürger der Vereinigten Arabischen Emirate, die über einen normalen Reisepass verfügen, sind für ihre touristischen Reisen in unser Land alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 90 gün süreyle vizeden muaftır. Umuma mahsus pasaport hamili Birleşik Arap Emirlikleri vatandaşları ülkemize yapacakları turistik amaçlı seyahatlerde her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "Official passport holders are exempt from visa for 90 days. Citizens of the United Arab Emirates who hold ordinary passports are exempt from visa for 90 days in every 180 days for their touristic trips to our country.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 90 Tage von der Visumpflicht befreit. Bürger der Vereinigten Arabischen Emirate, die über einen normalen Reisepass verfügen, sind für ihre touristischen Reisen in unser Land alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ae.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "United Kingdom",
        "iso2": "gb",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri turistik amaçlı seyahatlerinde vizeden muaftır.",
            "en": "Ordinary passport holders are exempt from visa for touristic travels.",
            "de": "Normale Reisepassinhaber sind für touristische Reisen von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/gb.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "United States of America",
        "iso2": "us",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamili ABD vatandaşları ülkemize yapacakları turistik amaçlı seyahatlerde her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "US citizens holding ordinary passports are exempt from visa for 90 days in every 180 days during their touristic trips to our country.",
            "de": "US-Bürger, die einen gewöhnlichen Reisepass besitzen, sind während ihrer touristischen Reisen in unser Land alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Umuma mahsus pasaport hamili ABD vatandaşları ülkemize yapacakları turistik amaçlı seyahatlerde her 180 günde 90 gün süreyle vizeden muaftır.",
            "en": "US citizens holding ordinary passports are exempt from visa for 90 days in every 180 days during their touristic trips to our country.",
            "de": "US-Bürger, die einen gewöhnlichen Reisepass besitzen, sind während ihrer touristischen Reisen in unser Land alle 180 Tage für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/us.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Uruguay",
        "iso2": "uy",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/uy.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Uzbekistan",
        "iso2": "uz",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Diplomatik ve umuma mahsus pasaport hamilleri her 180 gün içinde 90 güne kadar vizeden muaftır.",
            "en": "Diplomatic and ordinary passport holders are exempt from visa for up to 90 days in every 180 days.",
            "de": "Inhaber von Diplomatenpässen und gewöhnlichen Reisepässen sind alle 180 Tage für bis zu 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Diplomatik ve umuma mahsus pasaport hamilleri her 180 gün içinde 90 güne kadar vizeden muaftır.",
            "en": "Diplomatic and ordinary passport holders are exempt from visa for up to 90 days in every 180 days.",
            "de": "Inhaber von Diplomatenpässen und gewöhnlichen Reisepässen sind alle 180 Tage für bis zu 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/uz.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Vanuatu",
        "iso2": "vu",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri vizeye tabidir. Umuma mahsus pasaport hamillerine giriş vizeleri dış temsilciliklerimizce en fazla 15 gün, transit vizeleri en fazla 7 gün ikamet süreli verilir.",
            "en": "Official and ordinary passport holders are subject to a visa. Entry visas for ordinary passport holders are issued by our foreign representative offices for a maximum residence period of 15 days, and transit visas for a maximum residence period of 7 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe unterliegen der Visumspflicht. Einreisevisa für normale Passinhaber werden von unseren Auslandsvertretungen für eine maximale Aufenthaltsdauer von 15 Tagen ausgestellt, Transitvisa für eine maximale Aufenthaltsdauer von 7 Tagen."
        },
        "durations": {
            "tr": "Umuma mahsus pasaport hamillerine giriş vizeleri dış temsilciliklerimizce en fazla 15 gün, transit vizeleri en fazla 7 gün ikamet süreli verilir.",
            "en": "Entry visas for ordinary passport holders are issued by our foreign representative offices for a maximum residence period of 15 days, and transit visas for a maximum residence period of 7 days.",
            "de": "Einreisevisa für normale Passinhaber werden von unseren Auslandsvertretungen für eine maximale Aufenthaltsdauer von 15 Tagen ausgestellt, Transitvisa für eine maximale Aufenthaltsdauer von 7 Tagen."
        },
        "flag": "https:\/\/flagcdn.com\/vu.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Vatican City",
        "iso2": "va",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi ve umuma mahsus pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Official and ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber offizieller und gewöhnlicher Reisepässe sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/va.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Venezuela, Bolivarian Republic of",
        "iso2": "ve",
        "visa_type": "no_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri ise 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary passport holders are exempt from visa for 90 days.",
            "de": "Normale Passinhaber sind 90 Tage lang von der Visumpflicht befreit."
        },
        "durations": {
            "tr": "Resmi pasaport hamilleri 30 gün süreyle vizeden muaftır. Umuma mahsus pasaport hamilleri ise 90 gün süreyle vizeden muaftır.",
            "en": "Official passport holders are exempt from visa for 30 days. Ordinary passport holders are exempt from visa for 90 days.",
            "de": "Inhaber eines offiziellen Reisepasses sind für 30 Tage von der Visumpflicht befreit. Normale Passinhaber sind 90 Tage lang von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/ve.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Viet Nam",
        "iso2": "vn",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri 30 güne kadar ikamet süreli tek girişli elektronik vizelerini www.evisa.gov.tr internet adresinden alabilmektedir.",
            "en": "Ordinary passport holders can obtain single-entry electronic visas for a residence period of up to 30 days from the website www.evisa.gov.tr.",
            "de": "Normale Passinhaber können auf der Website www.evisa.gov.tr ​​ein elektronisches Visum für die einmalige Einreise für einen Aufenthaltszeitraum von bis zu 30 Tagen erhalten."
        },
        "durations": {
            "tr": "Umuma mahsus pasaport hamilleri 30 güne kadar ikamet süreli tek girişli elektronik vizelerini www.evisa.gov.tr internet adresinden alabilmektedir. Resmi pasaport hamilleri 90 gün süreyle vizeden muaftır.",
            "en": "Ordinary passport holders can obtain single-entry electronic visas for a residence period of up to 30 days from the website www.evisa.gov.tr. Official passport holders are exempt from visa for 90 days.",
            "de": "Normale Passinhaber können auf der Website www.evisa.gov.tr ​​ein elektronisches Visum für die einmalige Einreise für einen Aufenthaltszeitraum von bis zu 30 Tagen erhalten. Inhaber eines offiziellen Reisepasses sind für 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/vn.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Yemen",
        "iso2": "ye",
        "visa_type": "e_visa",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri ise vizeye tabidir.",
            "en": "Ordinary passport holders are subject to a visa.",
            "de": "Inhaber eines normalen Reisepasses sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik ve resmi pasaport hamilleri 30 gün süreyle vizeden muaftır. Schengen ülkeleri veya ABD, Birleşik Krallık, İrlanda geçerli vizesi veya geçerli ikamet izni hamillerine, belirli şartları taşımaları koşuluyla, 30 güne kadar ikamet süreli tek giriş vizesi www.evisa.gov.tr internet adresinden e-Vize olarak ita edilmektedir.",
            "en": "Diplomatic and official passport holders are exempt from visa for 30 days. A single entry visa with a residence period of up to 30 days is issued as an e-Visa on the website www.evisa.gov.tr ​​for holders of a valid visa or valid residence permit from Schengen countries or the USA, the United Kingdom, Ireland, provided that they meet certain conditions.",
            "de": "Diplomaten- und Amtspassinhaber sind für 30 Tage von der Visumpflicht befreit. Ein einmaliges Einreisevisum mit einer Aufenthaltsdauer von bis zu 30 Tagen wird als E-Visum auf der Website www.evisa.gov.tr ​​für Inhaber eines gültigen Visums oder einer gültigen Aufenthaltserlaubnis aus Schengen-Staaten oder den USA, dem Vereinigten Königreich, Irland ausgestellt, sofern sie bestimmte Voraussetzungen erfüllen."
        },
        "flag": "https:\/\/flagcdn.com\/ye.svg",
        "source": "https:\/\/www.evisa.gov.tr\/",
        "last_update": "2025-11-10"
    },
    {
        "country": "Zambia",
        "iso2": "zm",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus pasaport hamilleri vizeye tabidir.",
            "en": "Ordinary passport holders are subject to a visa.",
            "de": "Inhaber eines normalen Reisepasses sind visumpflichtig."
        },
        "durations": {
            "tr": "Diplomatik pasaport hamilleri her 180 gün içinde 90 güne kadar vizeden muaftır.",
            "en": "Diplomatic passport holders are exempt from visa for up to 90 days in every 180 days.",
            "de": "Inhaber eines Diplomatenpasses sind alle 180 Tage für bis zu 90 Tage von der Visumpflicht befreit."
        },
        "flag": "https:\/\/flagcdn.com\/zm.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    },
    {
        "country": "Zimbabwe",
        "iso2": "zw",
        "visa_type": "consular",
        "descriptions": {
            "tr": "Umuma mahsus ve resmi pasaport hamilleri vizeye tabidir.",
            "en": "Ordinary and official passport holders are subject to a visa.",
            "de": "Inhaber eines gewöhnlichen und offiziellen Reisepasses sind visumpflichtig."
        },
        "durations": {
            "tr": "Kalış süresi kaynak tarafından belirtilmemiştir.",
            "en": "The length of stay is not specified by the source.",
            "de": "Die Aufenthaltsdauer wird von der Quelle nicht angegeben."
        },
        "flag": "https:\/\/flagcdn.com\/zw.svg",
        "source": "https:\/\/www.mfa.gov.tr\/visa-information-for-foreigners.en.mfa",
        "last_update": "2025-11-10"
    }
]